docs/pipeline.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-08 Fri 10:41 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Preterm Birth Fine Mapping</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Nicholas Knoblauch">
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Preterm Birth Fine Mapping</h1>
