docs/pipeline.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9e5b660">Cluster configuration</a></li>
<li><a href="#orgf649df6">Baseline model</a></li>
<li><a href="#orgaf0914a">Pipeline configurations</a>
<ul>
<li><a href="#org1ebd971">Model parameters</a></li>
<li><a href="#orgbcbd5dd">Snakemake Analysis Pipeline</a></li>
<li><a href="#org3781b54">Master rule</a></li>
<li><a href="#org142bf13">Running FastQTL</a></li>
<li><a href="#org6918ec1">fine mapping with eqtl data</a></li>
<li><a href="#org24d7988">Generating Plots</a></li>
<li><a href="#org32f6151">motifbreakR</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org9e5b660" class="outline-2">
<h2 id="org9e5b660">Cluster configuration</h2>
<div class="outline-text-2" id="text-org9e5b660">
<p>
I start off by defining some absolute directories that will be referred to throughout the script.  
The motivation for the structure of this yaml file is that I can run the analysis on 
different clusters and only have to change/add a <code>path</code> object and a <code>flag</code> file (a file
or directory  that exists only on the file system for that machine)
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #5D6A70;">---</span>
<span style="color: #FF9326;">flag_file</span>: <span style="color: #FFE203;">&amp;hst</span> <span style="color: #99D6FF;">!Host</span> {<span style="color: #FF9326;">options</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFABAB;">"/project2"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"/gpfs/data/xhe-lab/"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"/run/media/nwknoblauch/Data"</span>} }
<span style="color: #FF9326;">paths</span>: 
  <span style="color: #FFABAB;">'DL'</span>: <span style="color: #FFE203;">&amp;dl</span>  <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>:  null, <span style="color: #FF9326;">path</span>: { <span style="color: #FF9326;">midway2</span>: <span style="color: #FFABAB;">"/project2/xinhe/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"/gpfs/data/xhe-lab/"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"/run/media/nwknoblauch/Data/"</span>}}
  <span style="color: #FFABAB;">'1KG'</span>:     <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;1kg</span> <span style="color: #FFABAB;">"1kg/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFE203;">*1kg</span> , <span style="color: #FF9326;">desktop</span>: <span style="color: #FFE203;">*1kg</span>} }
  <span style="color: #FFABAB;">'OBERF'</span>:   <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFABAB;">"missing_file"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">'Ober/'</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">''</span> } }
  <span style="color: #FFABAB;">'BED'</span>:     <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;bed</span> <span style="color: #FFABAB;">"genomic_annotation/ptb_epigenetic/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFE203;">*bed</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"ptb_scratch/new_bed/"</span>}}
  <span style="color: #FFABAB;">'L2'</span>:      <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;l2</span> <span style="color: #FFABAB;">"genomic_annotation/L2/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFE203;">*l2</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"L2/"</span>}}
  <span style="color: #FFABAB;">'ANNO'</span>:    <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFABAB;">"nwknoblauch/torus_annotations/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"genomic_annotation/torus_annotations/"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"genomic_annotation/torus_annotations/"</span>}}
  <span style="color: #FFABAB;">'FINEMAP'</span>: <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFABAB;">"nwknoblauch/susie_finemapping/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"genomic_annotation/susie_finemapping/"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"genomic_annotation/susie_finemapping/"</span>}}
  <span style="color: #FFABAB;">'WEIGHTS'</span>: <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;weight</span> <span style="color: #FFABAB;">"1kg/1000G_Phase3_weights_hm3_no_MHC/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFE203;">*weight</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFE203;">*weight</span>}} 
  <span style="color: #FFABAB;">'FRQF'</span>:    <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;frq</span> <span style="color: #FFABAB;">"1kg/1000G_Phase3_frq/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFE203;">*frq</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"1kg/1000G_Phase3_frq/"</span>}} 
  <span style="color: #FFABAB;">'GWAS'</span>:    <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: null, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;gwas</span> <span style="color: #FFABAB;">"ptb/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"/scratch/t.cri.nknoblauch/ptb_scratch/"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"/run/media/nwknoblauch/Data/gwas_data/gwas_sumstats/"</span>}}
  <span style="color: #FFABAB;">'UKB_LDSC'</span>:    <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: <span style="color: #FFE203;">*dl</span>, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;ukbldsc</span> <span style="color: #FFABAB;">"ukb_ldsc/"</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFE203;">*ukbldsc</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"../Backup412/ukb_ldsc/"</span>}}
  <span style="color: #FFABAB;">'UKB_BGEN'</span>:    <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: null, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>:  <span style="color: #FFABAB;">""</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"/gpfs/data/pierce-lab/uk-biobank-genotypes/"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"/run/media/nwknoblauch/Data/DGN/hg19"</span>}}
  <span style="color: #FFABAB;">'UKB_PED'</span>:    <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: null, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>:  <span style="color: #FFABAB;">""</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"/scratch/t.cri.nknoblauch/intersect_snplist/ukb_subset/"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"/run/media/nwknoblauch/Data/DGN/hg19"</span>}}
  <span style="color: #FFABAB;">'SNPLIST_D'</span>:  <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: null, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>:  <span style="color: #FFABAB;">""</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"/scratch/t.cri.nknoblauch/intersect_snplist/"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">""</span>}}
  <span style="color: #FFABAB;">'LDSC'</span>:    <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: null, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;ldsc</span> <span style="color: #FFABAB;">"module load /home/nwknoblauch/spack_modules/ldsc/1.0.3; "</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"spack env activate ldsc_v &amp;&amp;"</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"spack load py-ldsc-git &amp;&amp; "</span>}}
  <span style="color: #FFABAB;">'TORUS_CMD'</span>: <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>: null, <span style="color: #FF9326;">path</span>: {<span style="color: #FF9326;">midway2</span>: <span style="color: #FFE203;">&amp;cmd</span> <span style="color: #FFABAB;">""</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">""</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">"/run/media/nwknoblauch/Backup412/spack/opt/spack/linux-manjaro19-haswell/gcc-9.3.0/dap-cmake-git-master-wotuvad7zivnzwvlztsobu4llto5owdi/bin/torus"</span>}}
<span style="color: #FF9326;">envs</span>:
  <span style="color: #FFABAB;">'r'</span>:    <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>:  null, <span style="color: #FF9326;">path</span>: { <span style="color: #FF9326;">midway2</span>: null, <span style="color: #FF9326;">gardner</span>: null, <span style="color: #FF9326;">desktop</span>: null }}
  <span style="color: #FFABAB;">'ldsc'</span>: <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>:  null, <span style="color: #FF9326;">path</span>: { <span style="color: #FF9326;">midway2</span>: null, <span style="color: #FF9326;">gardner</span>: null, <span style="color: #FF9326;">desktop</span>: null }}
  <span style="color: #FFABAB;">'cmd_prefix'</span>: <span style="color: #99D6FF;">!Dep</span> {<span style="color: #FF9326;">host</span>: <span style="color: #FFE203;">*hst</span>, <span style="color: #FF9326;">pref</span>:  null, <span style="color: #FF9326;">path</span>: { <span style="color: #FF9326;">midway2</span>: <span style="color: #FFABAB;">""</span>, <span style="color: #FF9326;">gardner</span>: <span style="color: #FFABAB;">"spack env activate ger; "</span>, <span style="color: #FF9326;">desktop</span>: <span style="color: #FFABAB;">". /run/media/nwknoblauch/Backup412/spack/share/spack/setup-env.sh;"</span>  }}
</pre>
</div>
</div>
</div>
