org/pipeline.org
** Config :noexport:

#+BEGIN_SRC R :tangle ../scripts/parse_yaml.R

  config_basef <- "../workflow/config_base.yaml"
  annotf <- "../workflow/annots.yaml"

  host_fun <- function(x) {
    xo <- x$options
    for (n in names(xo)) {
      if (fs::dir_exists(xo[[n]])) {
        return(n)
      }
    }
  }

  dep_fun <- function(x) {
    if (is.null(x$pref)) 
      return(x$path[[x$host]])
    return(fs::path(x$pref,x$path[[x$host]]))
  }

  handler_l <- list(
    Host = host_fun,
    Dep = dep_fun
  )

  config <- yaml::read_yaml(
                      config_basef,
                    handlers =  handler_l)
  config_d <- config$paths
  annot <- yaml::read_yaml(annotf)
#+END_SRC


#+BEGIN_SRC yaml :tangle ../workflow/cluster_config.yaml
  ---
  __default__:
    partition: 'broadwl'
    time: '01:00:00'
    nodes: '1'
    ntasks: '1'
    cpuspertask: '1'
    output: "output/{rule}_{wildcards}_txt"
    error: "error/{rule}_{wildcards}_txt"
    export: "ALL"
    mem: '12gb'
  gcta_h2:
    time: '00:20:00'
    mem: '16gb'
  poly_sim_pheno:
    time: '01:00:00'
    mem: '25gb'
  plink_gwas_cov:
    time: '01:30:00'
    mem: '16gb'
    cpuspertask: '12'
  all_gen_grm:
    time: '00:10:00'
    mem: '4gb'
  anno2torus_fdr:
    mem: '45G'
  ldshrink_ld:
    mem: '22gb'
    time: '01:00:00'
  rssp:
    mem: '32gb'
    time: '01:25:00'
  run_ldsc:
    mem: '45gb'
    time: '02:00:00'
  run_fastqtl_region:
    mem: '3gb'
    time: '00:30:00'
#+END_SRC


#+BEGIN_SRC  R :results output :eval no
  library(ldmap)
  library(tidyverse)
  lddf <- tibble::enframe(ldetect_EUR) %>%
    explode_ldmap_region() %>% mutate(chrom = as.integer(chrom))
  jsonlite::toJSON(lddf)
#+END_SRC

* Baseline model

#+BEGIN_SRC yaml :tangle ../workflow/base_model.yaml
  - 'Coding_UCSCL2'
  - 'Coding_UCSC.flanking.500L2'
  - 'Conserved_LindbladTohL2'
  - 'Conserved_LindbladToh.flanking.500L2'
  - 'CTCF_HoffmanL2'
  - 'CTCF_Hoffman.flanking.500L2'
  - 'DGF_ENCODEL2'
  - 'DGF_ENCODE.flanking.500L2'
  - 'DHS_peaks_TrynkaL2'
  - 'DHS_TrynkaL2'
  - 'DHS_Trynka.flanking.500L2'
  - 'Enhancer_AnderssonL2'
  - 'Enhancer_Andersson.flanking.500L2'
  - 'Enhancer_HoffmanL2'
  - 'Enhancer_Hoffman.flanking.500L2'
  - 'FetalDHS_TrynkaL2'
  - 'FetalDHS_Trynka.flanking.500L2'
  - 'H3K27ac_HniszL2'
  - 'H3K27ac_Hnisz.flanking.500L2'
  - 'H3K27ac_PGC2L2'
  - 'H3K27ac_PGC2.flanking.500L2'
  - 'H3K4me1_peaks_TrynkaL2'
  - 'H3K4me1_TrynkaL2'
  - 'H3K4me1_Trynka.flanking.500L2'
  - 'H3K4me3_peaks_TrynkaL2'
  - 'H3K4me3_TrynkaL2'
  - 'H3K4me3_Trynka.flanking.500L2'
  - 'H3K9ac_peaks_TrynkaL2'
  - 'H3K9ac_TrynkaL2'
  - 'H3K9ac_Trynka.flanking.500L2'
  - 'Intron_UCSCL2'
  - 'Intron_UCSC.flanking.500L2'
  - 'PromoterFlanking_HoffmanL2'
  - 'PromoterFlanking_Hoffman.flanking.500L2'
  - 'Promoter_UCSCL2'
  - 'Promoter_UCSC.flanking.500L2'
  - 'Repressed_HoffmanL2'
  - 'Repressed_Hoffman.flanking.500L2'
  - 'SuperEnhancer_HniszL2'
  - 'SuperEnhancer_Hnisz.flanking.500L2'
  - 'TFBS_ENCODEL2'
  - 'TFBS_ENCODE.flanking.500L2'
  - 'Transcr_HoffmanL2'
  - 'Transcr_Hoffman.flanking.500L2'
  - 'TSS_HoffmanL2'
  - 'TSS_Hoffman.flanking.500L2'
  - 'UTR_3_UCSCL2'
  - 'UTR_3_UCSC.flanking.500L2'
  - 'UTR_5_UCSCL2'
  - 'UTR_5_UCSC.flanking.500L2'
  - 'WeakEnhancer_HoffmanL2'
  - 'WeakEnhancer_Hoffman.flanking.500L2'
  - 'GERP.NSL2'
  - 'GERP.RSsup4L2'
  - 'MAFbin1L2'
  - 'MAFbin2L2'
  - 'MAFbin3L2'
  - 'MAFbin4L2'
  - 'MAFbin5L2'
  - 'MAFbin6L2'
  - 'MAFbin7L2'
  - 'MAFbin8L2'
  - 'MAFbin9L2'
  - 'MAFbin10L2'
  - 'MAF_Adj_Predicted_Allele_AgeL2'
  - 'MAF_Adj_LLD_AFRL2'
  - 'Recomb_Rate_10kbL2'
  - 'Nucleotide_Diversity_10kbL2'
  - 'Backgrd_Selection_StatL2'
  - 'CpG_Content_50kbL2'
  - 'MAF_Adj_ASMCL2'
  - 'GTEx_eQTL_MaxCPPL2'
  - 'BLUEPRINT_H3K27acQTL_MaxCPPL2'
  - 'BLUEPRINT_H3K4me1QTL_MaxCPPL2'
  - 'BLUEPRINT_DNA_methylation_MaxCPPL2'
  - 'synonymousL2'
  - 'non_synonymousL2'
  - 'Conserved_Vertebrate_phastCons46wayL2'
  - 'Conserved_Vertebrate_phastCons46way.flanking.500L2'
  - 'Conserved_Mammal_phastCons46wayL2'
  - 'Conserved_Mammal_phastCons46way.flanking.500L2'
  - 'Conserved_Primate_phastCons46wayL2'
  - 'Conserved_Primate_phastCons46way.flanking.500L2'
  - 'BivFlnkL2'
  - 'BivFlnk.flanking.500L2'
  - 'Human_Promoter_VillarL2'
  - 'Human_Promoter_Villar.flanking.500L2'
  - 'Human_Enhancer_VillarL2'
  - 'Human_Enhancer_Villar.flanking.500L2'
  - 'Ancient_Sequence_Age_Human_PromoterL2'
  - 'Ancient_Sequence_Age_Human_Promoter.flanking.500L2'
  - 'Ancient_Sequence_Age_Human_EnhancerL2'
  - 'Ancient_Sequence_Age_Human_Enhancer.flanking.500L2'
  - 'Human_Enhancer_Villar_Species_Enhancer_CountL2'
  - 'Human_Promoter_Villar_ExACL2'
  - 'Human_Promoter_Villar_ExAC.flanking.500L2'
#+END_SRC

* Pipeline configurations

