docs/pipeline.html

<div id="outline-container-orgf649df6" class="outline-2">
<h2 id="orgf649df6">Baseline model</h2>
<div class="outline-text-2" id="text-orgf649df6">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #FFABAB;">'Coding_UCSCL2'</span>
- <span style="color: #FFABAB;">'Coding_UCSC.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Conserved_LindbladTohL2'</span>
- <span style="color: #FFABAB;">'Conserved_LindbladToh.flanking.500L2'</span>
- <span style="color: #FFABAB;">'CTCF_HoffmanL2'</span>
- <span style="color: #FFABAB;">'CTCF_Hoffman.flanking.500L2'</span>
- <span style="color: #FFABAB;">'DGF_ENCODEL2'</span>
- <span style="color: #FFABAB;">'DGF_ENCODE.flanking.500L2'</span>
- <span style="color: #FFABAB;">'DHS_peaks_TrynkaL2'</span>
- <span style="color: #FFABAB;">'DHS_TrynkaL2'</span>
- <span style="color: #FFABAB;">'DHS_Trynka.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Enhancer_AnderssonL2'</span>
- <span style="color: #FFABAB;">'Enhancer_Andersson.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Enhancer_HoffmanL2'</span>
- <span style="color: #FFABAB;">'Enhancer_Hoffman.flanking.500L2'</span>
- <span style="color: #FFABAB;">'FetalDHS_TrynkaL2'</span>
- <span style="color: #FFABAB;">'FetalDHS_Trynka.flanking.500L2'</span>
- <span style="color: #FFABAB;">'H3K27ac_HniszL2'</span>
- <span style="color: #FFABAB;">'H3K27ac_Hnisz.flanking.500L2'</span>
- <span style="color: #FFABAB;">'H3K27ac_PGC2L2'</span>
- <span style="color: #FFABAB;">'H3K27ac_PGC2.flanking.500L2'</span>
- <span style="color: #FFABAB;">'H3K4me1_peaks_TrynkaL2'</span>
- <span style="color: #FFABAB;">'H3K4me1_TrynkaL2'</span>
- <span style="color: #FFABAB;">'H3K4me1_Trynka.flanking.500L2'</span>
- <span style="color: #FFABAB;">'H3K4me3_peaks_TrynkaL2'</span>
- <span style="color: #FFABAB;">'H3K4me3_TrynkaL2'</span>
- <span style="color: #FFABAB;">'H3K4me3_Trynka.flanking.500L2'</span>
- <span style="color: #FFABAB;">'H3K9ac_peaks_TrynkaL2'</span>
- <span style="color: #FFABAB;">'H3K9ac_TrynkaL2'</span>
- <span style="color: #FFABAB;">'H3K9ac_Trynka.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Intron_UCSCL2'</span>
- <span style="color: #FFABAB;">'Intron_UCSC.flanking.500L2'</span>
- <span style="color: #FFABAB;">'PromoterFlanking_HoffmanL2'</span>
- <span style="color: #FFABAB;">'PromoterFlanking_Hoffman.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Promoter_UCSCL2'</span>
- <span style="color: #FFABAB;">'Promoter_UCSC.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Repressed_HoffmanL2'</span>
- <span style="color: #FFABAB;">'Repressed_Hoffman.flanking.500L2'</span>
- <span style="color: #FFABAB;">'SuperEnhancer_HniszL2'</span>
- <span style="color: #FFABAB;">'SuperEnhancer_Hnisz.flanking.500L2'</span>
- <span style="color: #FFABAB;">'TFBS_ENCODEL2'</span>
- <span style="color: #FFABAB;">'TFBS_ENCODE.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Transcr_HoffmanL2'</span>
- <span style="color: #FFABAB;">'Transcr_Hoffman.flanking.500L2'</span>
- <span style="color: #FFABAB;">'TSS_HoffmanL2'</span>
- <span style="color: #FFABAB;">'TSS_Hoffman.flanking.500L2'</span>
- <span style="color: #FFABAB;">'UTR_3_UCSCL2'</span>
- <span style="color: #FFABAB;">'UTR_3_UCSC.flanking.500L2'</span>
- <span style="color: #FFABAB;">'UTR_5_UCSCL2'</span>
- <span style="color: #FFABAB;">'UTR_5_UCSC.flanking.500L2'</span>
- <span style="color: #FFABAB;">'WeakEnhancer_HoffmanL2'</span>
- <span style="color: #FFABAB;">'WeakEnhancer_Hoffman.flanking.500L2'</span>
- <span style="color: #FFABAB;">'GERP.NSL2'</span>
- <span style="color: #FFABAB;">'GERP.RSsup4L2'</span>
- <span style="color: #FFABAB;">'MAFbin1L2'</span>
- <span style="color: #FFABAB;">'MAFbin2L2'</span>
- <span style="color: #FFABAB;">'MAFbin3L2'</span>
- <span style="color: #FFABAB;">'MAFbin4L2'</span>
- <span style="color: #FFABAB;">'MAFbin5L2'</span>
- <span style="color: #FFABAB;">'MAFbin6L2'</span>
- <span style="color: #FFABAB;">'MAFbin7L2'</span>
- <span style="color: #FFABAB;">'MAFbin8L2'</span>
- <span style="color: #FFABAB;">'MAFbin9L2'</span>
- <span style="color: #FFABAB;">'MAFbin10L2'</span>
- <span style="color: #FFABAB;">'MAF_Adj_Predicted_Allele_AgeL2'</span>
- <span style="color: #FFABAB;">'MAF_Adj_LLD_AFRL2'</span>
- <span style="color: #FFABAB;">'Recomb_Rate_10kbL2'</span>
- <span style="color: #FFABAB;">'Nucleotide_Diversity_10kbL2'</span>
- <span style="color: #FFABAB;">'Backgrd_Selection_StatL2'</span>
- <span style="color: #FFABAB;">'CpG_Content_50kbL2'</span>
- <span style="color: #FFABAB;">'MAF_Adj_ASMCL2'</span>
- <span style="color: #FFABAB;">'GTEx_eQTL_MaxCPPL2'</span>
- <span style="color: #FFABAB;">'BLUEPRINT_H3K27acQTL_MaxCPPL2'</span>
- <span style="color: #FFABAB;">'BLUEPRINT_H3K4me1QTL_MaxCPPL2'</span>
- <span style="color: #FFABAB;">'BLUEPRINT_DNA_methylation_MaxCPPL2'</span>
- <span style="color: #FFABAB;">'synonymousL2'</span>
- <span style="color: #FFABAB;">'non_synonymousL2'</span>
- <span style="color: #FFABAB;">'Conserved_Vertebrate_phastCons46wayL2'</span>
- <span style="color: #FFABAB;">'Conserved_Vertebrate_phastCons46way.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Conserved_Mammal_phastCons46wayL2'</span>
- <span style="color: #FFABAB;">'Conserved_Mammal_phastCons46way.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Conserved_Primate_phastCons46wayL2'</span>
- <span style="color: #FFABAB;">'Conserved_Primate_phastCons46way.flanking.500L2'</span>
- <span style="color: #FFABAB;">'BivFlnkL2'</span>
- <span style="color: #FFABAB;">'BivFlnk.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Human_Promoter_VillarL2'</span>
- <span style="color: #FFABAB;">'Human_Promoter_Villar.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Human_Enhancer_VillarL2'</span>
- <span style="color: #FFABAB;">'Human_Enhancer_Villar.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Ancient_Sequence_Age_Human_PromoterL2'</span>
- <span style="color: #FFABAB;">'Ancient_Sequence_Age_Human_Promoter.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Ancient_Sequence_Age_Human_EnhancerL2'</span>
- <span style="color: #FFABAB;">'Ancient_Sequence_Age_Human_Enhancer.flanking.500L2'</span>
- <span style="color: #FFABAB;">'Human_Enhancer_Villar_Species_Enhancer_CountL2'</span>
- <span style="color: #FFABAB;">'Human_Promoter_Villar_ExACL2'</span>
- <span style="color: #FFABAB;">'Human_Promoter_Villar_ExAC.flanking.500L2'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf0914a" class="outline-2">
<h2 id="orgaf0914a">Pipeline configurations</h2>
<div class="outline-text-2" id="text-orgaf0914a">
</div>
