org/pipeline.org
** Model parameters

There are a lot of annotations we've been working with.
Under each heading are the annotations associated with that model.
~clean~ and ~full~ refer to LD score regression baselines.
under ~ptb_torus_model~ are the features used for ~torus~

#+BEGIN_SRC yaml :tangle ../workflow/annots.yaml
  ---
  clean:
    - base
    - Coding_UCSC
    - Conserved_LindbladToh
    - Intron_UCSC
    - PromoterFlanking_Hoffman
    - Promoter_UCSC
    - Transcr_Hoffman
    - TSS_Hoffman
    - UTR_3_UCSC
    - UTR_5_UCSC
    - GERP.NS
    - GERP.RSsup4
    - MAFbin1
    - MAFbin2
    - MAFbin3
    - MAFbin4
    - MAFbin5
    - MAFbin6
    - MAFbin7
    - MAFbin8
    - MAFbin9
    - MAFbin10
    - MAF_Adj_Predicted_Allele_Age
    - MAF_Adj_LLD_AFR
    - Recomb_Rate_10kb
    - Nucleotide_Diversity_10kb
    - Backgrd_Selection_Stat
    - CpG_Content_50kb
    - MAF_Adj_ASMC
    - synonymous
    - non_synonymous
    - Conserved_Vertebrate_phastCons46way
    - Conserved_Mammal_phastCons46way
    - Conserved_Primate_phastCons46way
    - BivFlnk
  full: 
    - base
    - Coding_UCSC
    - Conserved_LindbladToh
    - CTCF_Hoffman
    - DGF_ENCODE
    - DHS_peaks_Trynka
    - DHS_Trynka
    - Enhancer_Andersson
    - Enhancer_Hoffman
    - FetalDHS_Trynka
    - H3K27ac_Hnisz
    - H3K27ac_PGC2
    - H3K4me1_peaks_Trynka
    - H3K4me1_Trynka
    - H3K4me3_peaks_Trynka
    - H3K4me3_Trynka
    - H3K9ac_peaks_Trynka
    - H3K9ac_Trynka
    - Intron_UCSC
    - PromoterFlanking_Hoffman
    - Promoter_UCSC
    - Repressed_Hoffman
    - SuperEnhancer_Hnisz
    - TFBS_ENCODE
    - Transcr_Hoffman
    - TSS_Hoffman
    - UTR_3_UCSC
    - UTR_5_UCSC
    - WeakEnhancer_Hoffman
    - GERP.NS
    - GERP.RSsup4
    - MAFbin1
    - MAFbin2
    - MAFbin3
    - MAFbin4
    - MAFbin5
    - MAFbin6
    - MAFbin7
    - MAFbin8
    - MAFbin9
    - MAFbin10
    - MAF_Adj_Predicted_Allele_Age
    - MAF_Adj_LLD_AFR
    - Recomb_Rate_10kb
    - Nucleotide_Diversity_10kb
    - Backgrd_Selection_Stat
    - CpG_Content_50kb
    - MAF_Adj_ASMC
    - GTEx_eQTL_MaxCPP
    - BLUEPRINT_H3K27acQTL_MaxCPP
    - BLUEPRINT_H3K4me1QTL_MaxCPP
    - BLUEPRINT_DNA_methylation_MaxCPP
    - synonymous
    - non_synonymous
    - Conserved_Vertebrate_phastCons46way
    - Conserved_Mammal_phastCons46way
    - Conserved_Primate_phastCons46way
    - BivFlnk
    - Human_Promoter_Villar
    - Human_Enhancer_Villar
    - Ancient_Sequence_Age_Human_Promoter
    - Ancient_Sequence_Age_Human_Enhancer
    - Human_Enhancer_Villar_Species_Enhancer_Count
    - Human_Promoter_Villar_ExAC
  ptb_torus_model:
    allhic:
      - chip-seq-dec_diff-H3K27ac
      - chip-seq-reproducible-ctr-H3K4me1
      - hicd-seq-both-dec-HIC
    treatedhic:
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - hicd-seq-both-dec-HIC
    reproduciblemerged:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - atac-seq-dec_diff-ATAC
      - chip-seq-dec_diff-H3K4me3
      - chip-seq-dec_diff-H3K27ac
      - chip-seq-dec_diff-H3K4me1
      - hicd-seq-both-dec-HIC
    utme3treatedhic:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - hicd-seq-both-dec-HIC
    untreatedhic:
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-ctr-H3K4me1
      - hicd-seq-both-dec-HIC
    targethic:
      - chip-seq-dec_diff-H3K27ac
      - chip-seq-reproducible-ctr-H3K4me1
      - hicd-seq-target-dec-HIC
    baithic:
      - chip-seq-dec_diff-H3K27ac
      - chip-seq-reproducible-ctr-H3K4me1
      - hicd-seq-bait-dec-HIC
    tcmdec:
      - atac-seq-reproducible-pl_dec-ATAC
      - atac-seq-reproducible-pl_tcm-ATAC
      - atac-seq-reproducible-tl_tcm-ATAC
      - atac-seq-reproducible-tl_dec-ATAC
    atac:
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
  ptb_ldsc_model:
    nopooled: 
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - chip-seq-reproducible-ctr-H3K27ac
      - atac-seq-reproducible-ctr-ATAC
      - chip-seq-dec_up-H3K4me1
      - chip-seq-dec_up-H3K4me3
      - atac-seq-dec_down-ATAC
      - chip-seq-dec_up-H3K27ac
      - chip-seq-dec_down-H3K4me3
      - atac-seq-dec_up-ATAC
      - chip-seq-dec_down-H3K27ac
      - chip-seq-dec_down-H3K4me1
    full: 
      - chip-seq-pooled-DSC1-dec-H3K27ac
      - atac-seq-pooled-DSC2-dec-ATAC
      - chip-seq-pooled-DSC1-ctr-H3K4me3
      - atac-seq-pooled-DSC3-ctr-ATAC
      - chip-seq-pooled-DSC3-ctr-H3K4me1
      - chip-seq-pooled-DSC1-ctr-H3K4me1
      - atac-seq-pooled-DSC1-ctr-ATAC
      - chip-seq-pooled-DSC3-dec-H3K4me3
      - chip-seq-pooled-DSC2-ctr-H3K4me1
      - chip-seq-pooled-DSC1-dec-H3K4me1
      - chip-seq-pooled-DSC2-ctr-H3K27ac
      - chip-seq-pooled-DSC2-dec-H3K4me1
      - chip-seq-pooled-DSC1-dec-H3K4me3
      - chip-seq-pooled-DSC2-dec-H3K27ac
      - chip-seq-pooled-DSC3-dec-H3K27ac
      - chip-seq-pooled-DSC3-dec-H3K4me1
      - chip-seq-pooled-DSC2-dec-H3K4me3
      - chip-seq-pooled-DSC2-ctr-H3K4me3
      - atac-seq-pooled-DSC1-dec-ATAC
      - chip-seq-pooled-DSC1-ctr-H3K27ac
      - atac-seq-pooled-DSC2-ctr-ATAC
      - atac-seq-pooled-DSC3-dec-ATAC
      - chip-seq-pooled-DSC3-ctr-H3K27ac
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - chip-seq-reproducible-ctr-H3K27ac
      - atac-seq-reproducible-ctr-ATAC
      - chip-seq-dec_up-H3K4me1
      - chip-seq-dec_up-H3K4me3
      - chip-seq-pooled-DSC3-ctr-H3K4me3
      - atac-seq-dec_down-ATAC
      - chip-seq-dec_up-H3K27ac
      - chip-seq-dec_down-H3K4me3
      - atac-seq-dec_up-ATAC
      - chip-seq-dec_down-H3K27ac
      - chip-seq-dec_down-H3K4me1
    tcmdec:
      - atac-seq-reproducible-pl_dec-ATAC
      - atac-seq-reproducible-pl_tcm-ATAC
      - atac-seq-reproducible-tl_tcm-ATAC
      - atac-seq-reproducible-tl_dec-ATAC
    tcmdecct:
      - atac-seq-reproducible-pl_dec-ATAC
      - atac-seq-reproducible-pl_tcm-ATAC
      - atac-seq-reproducible-tl_tcm-ATAC
      - atac-seq-reproducible-tl_dec-ATAC
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
    reproducible:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
    reproducibledec:
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - atac-seq-reproducible-dec-ATAC
    reproduciblectr:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-ctr-ATAC
    reproducible_up_down:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - chip-seq-dec_up-H3K4me1
      - chip-seq-dec_up-H3K4me3
      - atac-seq-dec_down-ATAC
      - chip-seq-dec_up-H3K27ac
      - chip-seq-dec_down-H3K4me3
      - atac-seq-dec_up-ATAC
      - chip-seq-dec_down-H3K27ac
      - chip-seq-dec_down-H3K4me1
      - hicd-seq-bait-dec-HIC
      - hicd-seq-target-dec-HIC
    reproduciblemerged:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - atac-seq-dec_diff-ATAC
      - chip-seq-dec_diff-H3K4me3
      - chip-seq-dec_diff-H3K27ac
      - chip-seq-dec_diff-H3K4me1
      - hicd-seq-both-dec-HIC
    reproduciblemergedtcm:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - atac-seq-dec_diff-ATAC
      - chip-seq-dec_diff-H3K4me3
      - chip-seq-dec_diff-H3K27ac
      - chip-seq-dec_diff-H3K4me1
      - hicd-seq-both-dec-HIC
      - atac-seq-reproducible-pl_dec-ATAC
      - atac-seq-reproducible-pl_tcm-ATAC
      - atac-seq-reproducible-tl_tcm-ATAC
      - atac-seq-reproducible-tl_dec-ATAC
    reproduciblenodiff:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - hicd-seq-both-dec-HIC
    reproduciblenodiffcsmc:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - hicd-seq-both-dec-HIC
      - peaks-cervical_smooth_muscle_cells
    reproduciblenodiffaorta:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - hicd-seq-both-dec-HIC
      - chip-seq-reproducible-aorta-H3K4me1
      - chip-seq-reproducible-aorta-H3K4me3
      - chip-seq-reproducible-aorta-H3K27ac
    reproduciblenodifffinte:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - hicd-seq-both-dec-HIC
      - chip-seq-reproducible-finte-H3K4me1
      - chip-seq-reproducible-finte-H3K4me3
      - chip-seq-reproducible-finte-H3K27ac
    reproduciblenodiffliver:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - hicd-seq-both-dec-HIC
      - chip-seq-reproducible-liver-H3K4me1
      - chip-seq-reproducible-liver-H3K4me3
      - chip-seq-reproducible-liver-H3K27ac
    reproduciblemergedcsmc:
      - chip-seq-reproducible-ctr-H3K4me3
      - chip-seq-reproducible-dec-H3K4me3
      - chip-seq-reproducible-dec-H3K27ac
      - chip-seq-reproducible-ctr-H3K27ac
      - chip-seq-reproducible-dec-H3K4me1
      - chip-seq-reproducible-ctr-H3K4me1
      - atac-seq-reproducible-dec-ATAC
      - atac-seq-reproducible-ctr-ATAC
      - atac-seq-dec_diff-ATAC
      - chip-seq-dec_diff-H3K4me3
      - chip-seq-dec_diff-H3K27ac
      - chip-seq-dec_diff-H3K4me1
      - hicd-seq-both-dec-HIC
      - peaks-cervical_smooth_muscle_cells
#+END_SRC

