docs/pipeline.html
<div id="outline-container-org1ebd971" class="outline-3">
<h3 id="org1ebd971">Model parameters</h3>
<div class="outline-text-3" id="text-org1ebd971">
<p>
There are a lot of annotations we've been working with.
Under each heading are the annotations associated with that model.
<code>clean</code> and <code>full</code> refer to LD score regression baselines.
under <code>ptb_torus_model</code> are the features used for <code>torus</code>
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #5D6A70;">---</span>
<span style="color: #FF9326;">clean</span>:
  - base
  - Coding_UCSC
  - Conserved_LindbladToh
  - Intron_UCSC
  - PromoterFlanking_Hoffman
  - Promoter_UCSC
  - Transcr_Hoffman
  - TSS_Hoffman
  - UTR_3_UCSC
  - UTR_5_UCSC
  - GERP.NS
  - GERP.RSsup4
  - MAFbin1
  - MAFbin2
  - MAFbin3
  - MAFbin4
  - MAFbin5
  - MAFbin6
  - MAFbin7
  - MAFbin8
  - MAFbin9
  - MAFbin10
  - MAF_Adj_Predicted_Allele_Age
  - MAF_Adj_LLD_AFR
  - Recomb_Rate_10kb
  - Nucleotide_Diversity_10kb
  - Backgrd_Selection_Stat
  - CpG_Content_50kb
  - MAF_Adj_ASMC
  - synonymous
  - non_synonymous
  - Conserved_Vertebrate_phastCons46way
  - Conserved_Mammal_phastCons46way
  - Conserved_Primate_phastCons46way
  - BivFlnk
<span style="color: #FF9326;">full</span>: 
  - base
  - Coding_UCSC
  - Conserved_LindbladToh
  - CTCF_Hoffman
  - DGF_ENCODE
  - DHS_peaks_Trynka
  - DHS_Trynka
  - Enhancer_Andersson
  - Enhancer_Hoffman
  - FetalDHS_Trynka
  - H3K27ac_Hnisz
  - H3K27ac_PGC2
  - H3K4me1_peaks_Trynka
  - H3K4me1_Trynka
  - H3K4me3_peaks_Trynka
  - H3K4me3_Trynka
  - H3K9ac_peaks_Trynka
  - H3K9ac_Trynka
  - Intron_UCSC
  - PromoterFlanking_Hoffman
  - Promoter_UCSC
  - Repressed_Hoffman
  - SuperEnhancer_Hnisz
  - TFBS_ENCODE
  - Transcr_Hoffman
  - TSS_Hoffman
  - UTR_3_UCSC
  - UTR_5_UCSC
  - WeakEnhancer_Hoffman
  - GERP.NS
  - GERP.RSsup4
  - MAFbin1
  - MAFbin2
  - MAFbin3
  - MAFbin4
  - MAFbin5
  - MAFbin6
  - MAFbin7
  - MAFbin8
  - MAFbin9
  - MAFbin10
  - MAF_Adj_Predicted_Allele_Age
  - MAF_Adj_LLD_AFR
  - Recomb_Rate_10kb
  - Nucleotide_Diversity_10kb
  - Backgrd_Selection_Stat
  - CpG_Content_50kb
  - MAF_Adj_ASMC
  - GTEx_eQTL_MaxCPP
  - BLUEPRINT_H3K27acQTL_MaxCPP
  - BLUEPRINT_H3K4me1QTL_MaxCPP
  - BLUEPRINT_DNA_methylation_MaxCPP
  - synonymous
  - non_synonymous
  - Conserved_Vertebrate_phastCons46way
  - Conserved_Mammal_phastCons46way
  - Conserved_Primate_phastCons46way
  - BivFlnk
  - Human_Promoter_Villar
  - Human_Enhancer_Villar
  - Ancient_Sequence_Age_Human_Promoter
  - Ancient_Sequence_Age_Human_Enhancer
  - Human_Enhancer_Villar_Species_Enhancer_Count
  - Human_Promoter_Villar_ExAC
<span style="color: #FF9326;">ptb_torus_model</span>:
  <span style="color: #FF9326;">allhic</span>:
    - chip-seq-dec_diff-H3K27ac
    - chip-seq-reproducible-ctr-H3K4me1
    - hicd-seq-both-dec-HIC
  <span style="color: #FF9326;">treatedhic</span>:
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - hicd-seq-both-dec-HIC
  <span style="color: #FF9326;">reproduciblemerged</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - atac-seq-dec_diff-ATAC
    - chip-seq-dec_diff-H3K4me3
    - chip-seq-dec_diff-H3K27ac
    - chip-seq-dec_diff-H3K4me1
    - hicd-seq-both-dec-HIC
  <span style="color: #FF9326;">utme3treatedhic</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - hicd-seq-both-dec-HIC
  <span style="color: #FF9326;">untreatedhic</span>:
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-ctr-H3K4me1
    - hicd-seq-both-dec-HIC
  <span style="color: #FF9326;">targethic</span>:
    - chip-seq-dec_diff-H3K27ac
    - chip-seq-reproducible-ctr-H3K4me1
    - hicd-seq-target-dec-HIC
  <span style="color: #FF9326;">baithic</span>:
    - chip-seq-dec_diff-H3K27ac
    - chip-seq-reproducible-ctr-H3K4me1
    - hicd-seq-bait-dec-HIC
  <span style="color: #FF9326;">tcmdec</span>:
    - atac-seq-reproducible-pl_dec-ATAC
    - atac-seq-reproducible-pl_tcm-ATAC
    - atac-seq-reproducible-tl_tcm-ATAC
    - atac-seq-reproducible-tl_dec-ATAC
  <span style="color: #FF9326;">atac</span>:
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
<span style="color: #FF9326;">ptb_ldsc_model</span>:
  <span style="color: #FF9326;">nopooled</span>: 
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - chip-seq-reproducible-ctr-H3K27ac
    - atac-seq-reproducible-ctr-ATAC
    - chip-seq-dec_up-H3K4me1
    - chip-seq-dec_up-H3K4me3
    - atac-seq-dec_down-ATAC
    - chip-seq-dec_up-H3K27ac
    - chip-seq-dec_down-H3K4me3
    - atac-seq-dec_up-ATAC
    - chip-seq-dec_down-H3K27ac
    - chip-seq-dec_down-H3K4me1
  <span style="color: #FF9326;">full</span>: 
    - chip-seq-pooled-DSC1-dec-H3K27ac
    - atac-seq-pooled-DSC2-dec-ATAC
    - chip-seq-pooled-DSC1-ctr-H3K4me3
    - atac-seq-pooled-DSC3-ctr-ATAC
    - chip-seq-pooled-DSC3-ctr-H3K4me1
    - chip-seq-pooled-DSC1-ctr-H3K4me1
    - atac-seq-pooled-DSC1-ctr-ATAC
    - chip-seq-pooled-DSC3-dec-H3K4me3
    - chip-seq-pooled-DSC2-ctr-H3K4me1
    - chip-seq-pooled-DSC1-dec-H3K4me1
    - chip-seq-pooled-DSC2-ctr-H3K27ac
    - chip-seq-pooled-DSC2-dec-H3K4me1
    - chip-seq-pooled-DSC1-dec-H3K4me3
    - chip-seq-pooled-DSC2-dec-H3K27ac
    - chip-seq-pooled-DSC3-dec-H3K27ac
    - chip-seq-pooled-DSC3-dec-H3K4me1
    - chip-seq-pooled-DSC2-dec-H3K4me3
    - chip-seq-pooled-DSC2-ctr-H3K4me3
    - atac-seq-pooled-DSC1-dec-ATAC
    - chip-seq-pooled-DSC1-ctr-H3K27ac
    - atac-seq-pooled-DSC2-ctr-ATAC
    - atac-seq-pooled-DSC3-dec-ATAC
    - chip-seq-pooled-DSC3-ctr-H3K27ac
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - chip-seq-reproducible-ctr-H3K27ac
    - atac-seq-reproducible-ctr-ATAC
    - chip-seq-dec_up-H3K4me1
    - chip-seq-dec_up-H3K4me3
    - chip-seq-pooled-DSC3-ctr-H3K4me3
    - atac-seq-dec_down-ATAC
    - chip-seq-dec_up-H3K27ac
    - chip-seq-dec_down-H3K4me3
    - atac-seq-dec_up-ATAC
    - chip-seq-dec_down-H3K27ac
    - chip-seq-dec_down-H3K4me1
  <span style="color: #FF9326;">tcmdec</span>:
    - atac-seq-reproducible-pl_dec-ATAC
    - atac-seq-reproducible-pl_tcm-ATAC
    - atac-seq-reproducible-tl_tcm-ATAC
    - atac-seq-reproducible-tl_dec-ATAC
  <span style="color: #FF9326;">tcmdecct</span>:
    - atac-seq-reproducible-pl_dec-ATAC
    - atac-seq-reproducible-pl_tcm-ATAC
    - atac-seq-reproducible-tl_tcm-ATAC
    - atac-seq-reproducible-tl_dec-ATAC
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
  <span style="color: #FF9326;">reproducible</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
  <span style="color: #FF9326;">reproducibledec</span>:
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - atac-seq-reproducible-dec-ATAC
  <span style="color: #FF9326;">reproduciblectr</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-ctr-ATAC
  <span style="color: #FF9326;">reproducible_up_down</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - chip-seq-dec_up-H3K4me1
    - chip-seq-dec_up-H3K4me3
    - atac-seq-dec_down-ATAC
    - chip-seq-dec_up-H3K27ac
    - chip-seq-dec_down-H3K4me3
    - atac-seq-dec_up-ATAC
    - chip-seq-dec_down-H3K27ac
    - chip-seq-dec_down-H3K4me1
    - hicd-seq-bait-dec-HIC
    - hicd-seq-target-dec-HIC
  <span style="color: #FF9326;">reproduciblemerged</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - atac-seq-dec_diff-ATAC
    - chip-seq-dec_diff-H3K4me3
    - chip-seq-dec_diff-H3K27ac
    - chip-seq-dec_diff-H3K4me1
    - hicd-seq-both-dec-HIC
  <span style="color: #FF9326;">reproduciblemergedtcm</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - atac-seq-dec_diff-ATAC
    - chip-seq-dec_diff-H3K4me3
    - chip-seq-dec_diff-H3K27ac
    - chip-seq-dec_diff-H3K4me1
    - hicd-seq-both-dec-HIC
    - atac-seq-reproducible-pl_dec-ATAC
    - atac-seq-reproducible-pl_tcm-ATAC
    - atac-seq-reproducible-tl_tcm-ATAC
    - atac-seq-reproducible-tl_dec-ATAC
  <span style="color: #FF9326;">reproduciblenodiff</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - hicd-seq-both-dec-HIC
  <span style="color: #FF9326;">reproduciblenodiffcsmc</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - hicd-seq-both-dec-HIC
    - peaks-cervical_smooth_muscle_cells
  <span style="color: #FF9326;">reproduciblenodiffaorta</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - hicd-seq-both-dec-HIC
    - chip-seq-reproducible-aorta-H3K4me1
    - chip-seq-reproducible-aorta-H3K4me3
    - chip-seq-reproducible-aorta-H3K27ac
  <span style="color: #FF9326;">reproduciblenodifffinte</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - hicd-seq-both-dec-HIC
    - chip-seq-reproducible-finte-H3K4me1
    - chip-seq-reproducible-finte-H3K4me3
    - chip-seq-reproducible-finte-H3K27ac
  <span style="color: #FF9326;">reproduciblenodiffliver</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - hicd-seq-both-dec-HIC
    - chip-seq-reproducible-liver-H3K4me1
    - chip-seq-reproducible-liver-H3K4me3
    - chip-seq-reproducible-liver-H3K27ac
  <span style="color: #FF9326;">reproduciblemergedcsmc</span>:
    - chip-seq-reproducible-ctr-H3K4me3
    - chip-seq-reproducible-dec-H3K4me3
    - chip-seq-reproducible-dec-H3K27ac
    - chip-seq-reproducible-ctr-H3K27ac
    - chip-seq-reproducible-dec-H3K4me1
    - chip-seq-reproducible-ctr-H3K4me1
    - atac-seq-reproducible-dec-ATAC
    - atac-seq-reproducible-ctr-ATAC
    - atac-seq-dec_diff-ATAC
    - chip-seq-dec_diff-H3K4me3
    - chip-seq-dec_diff-H3K27ac
    - chip-seq-dec_diff-H3K4me1
    - hicd-seq-both-dec-HIC
    - peaks-cervical_smooth_muscle_cells
</pre>
</div>
</div>
</div>
