docs/pipeline.html

<div id="outline-container-orgbcbd5dd" class="outline-3">
<h3 id="orgbcbd5dd">Snakemake Analysis Pipeline</h3>
<div class="outline-text-3" id="text-orgbcbd5dd">
<p>
The entire pipeline from downloading data to running analysis to generating figures for the paper are all available in this repository.  
There are additional software dependencies obviously not in this directory but they are all publicly available 
</p>
</div>
</div>

<div id="outline-container-org3781b54" class="outline-3">
<h3 id="org3781b54">Master rule</h3>
<div class="outline-text-3" id="text-org3781b54">
<div class="org-src-container">
<pre class="src src-snakemake"><span style="color: #C8FF03;">import</span> os
<span style="color: #C8FF03;">import</span> yaml
<span style="color: #C8FF03;">from</span> yaml <span style="color: #C8FF03;">import</span> Loader
<span style="color: #C8FF03;">import</span> json
<span style="color: #C8FF03;">import</span> re

<span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">with open('../workflow/regs.txt') as reg_file:</span>
<span style="color: #5D6A70;">#   </span><span style="color: #5D6A70;">all_regions = [int(x)-1 for x in reg_file]</span>

<span style="color: #C8FF03;">with</span> <span style="color: #B46DCC;">open</span>(<span style="color: #FFABAB;">'../workflow/ldetect_ch.json'</span>) <span style="color: #C8FF03;">as</span> json_file:
    <span style="color: #FF9326;">ldetect_data</span> = json.load(json_file)

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">host_loader</span>(loader,node):
    <span style="color: #FF9326;">fields</span> = loader.construct_mapping(node,deep=<span style="color: #C04040;">True</span>)
    <span style="color: #FF9326;">options</span>=fields[<span style="color: #FFABAB;">'options'</span>]
    <span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">print([options[name] for name in options.keys()])</span>
    <span style="color: #FF9326;">ret_opt</span> = [name <span style="color: #C8FF03;">for</span> name <span style="color: #C8FF03;">in</span> options.keys() <span style="color: #C8FF03;">if</span> os.path.exists(options[name])]
    <span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">print(ret_opt)</span>
    <span style="color: #C8FF03;">return</span> ret_opt[0]


<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">dep_loader</span>(loader,node):
    <span style="color: #FF9326;">options</span> = loader.construct_mapping(node,deep=<span style="color: #C04040;">True</span>)
    <span style="color: #FF9326;">host</span> = options[<span style="color: #FFABAB;">'host'</span>]
    <span style="color: #FF9326;">pref</span> = options[<span style="color: #FFABAB;">'pref'</span>]
    <span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">print(pref)</span>
    <span style="color: #FF9326;">host</span> =options[<span style="color: #FFABAB;">'host'</span>]
    <span style="color: #FF9326;">path</span> = options[<span style="color: #FFABAB;">'path'</span>]
    <span style="color: #FF9326;">full_path</span> = pref+path[host] <span style="color: #C8FF03;">if</span> pref <span style="color: #C8FF03;">is</span> <span style="color: #C8FF03;">not</span> <span style="color: #C04040;">None</span> <span style="color: #C8FF03;">else</span> path[host]
    <span style="color: #C8FF03;">return</span> full_path

yaml.Loader.add_constructor(<span style="color: #FFABAB;">'!Host'</span>, host_loader)
yaml.Loader.add_constructor(<span style="color: #FFABAB;">'!Dep'</span>, dep_loader)


<span style="color: #C8FF03;">with</span> <span style="color: #B46DCC;">open</span>(<span style="color: #FFABAB;">"../workflow/config_base.yaml"</span>) <span style="color: #C8FF03;">as</span> stream:
    <span style="color: #FF9326;">config</span>=yaml.load(stream,Loader=Loader)

<span style="color: #FF9326;">config_d</span> = config[<span style="color: #FFABAB;">'paths'</span>]
<span style="color: #FF9326;">config_e</span> = config[<span style="color: #FFABAB;">'envs'</span>]
<span style="color: #B46DCC;">shell</span>.prefix(config_e[<span style="color: #FFABAB;">'cmd_prefix'</span>])



<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">anno_files</span>(anno):
  <span style="color: #C8FF03;">return</span> <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'BED'</span>] +<span style="color: #FFABAB;">"{anno_name}.bed"</span>,anno_name=anno)

<span style="color: #C8FF03;">with</span> <span style="color: #B46DCC;">open</span>(<span style="color: #FFABAB;">"../workflow/annots.yaml"</span>, <span style="color: #FFABAB;">'r'</span>) <span style="color: #C8FF03;">as</span> stream:
    <span style="color: #FF9326;">all_annot</span> = yaml.safe_load(stream)
      <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">(all_annot)</span>

<span style="color: #C8FF03;">wildcard_constraints</span>:
    <span style="color: #FF9326;">h2</span>=<span style="color: #FFABAB;">"[+-]?[0-9]+\.[0-9]+"</span>

<span style="color: #5D6A70;">#      </span><span style="color: #5D6A70;">chrom="\d+",</span>
<span style="color: #5D6A70;">#      </span><span style="color: #5D6A70;">gwas="[fgdptb]+",</span>
<span style="color: #5D6A70;">#      </span><span style="color: #5D6A70;">new_base="[a-z]+",</span>
<span style="color: #5D6A70;">#      </span><span style="color: #5D6A70;">region_id="\d+"</span>

<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">localrules: all,get_hm3_snplist,get_plinkfiles,get_frq,get_weights,get_narrowpeak_aorta,get_narrowpeak_finte,get_narrowpeak_liver,prep_covars</span>

<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">include: "h5_gwas_snakefile"</span>
<span style="color: #C8FF03;">include</span>: <span style="color: #FFABAB;">"dl_hm3_snakefile"</span>
<span style="color: #C8FF03;">include</span>: <span style="color: #FFABAB;">"dl_snakefile"</span>
<span style="color: #C8FF03;">include</span>: <span style="color: #FFABAB;">"dl_gwas_snakefile"</span>


<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">include: "eqtl_snakefile"</span>
<span style="color: #C8FF03;">include</span>: <span style="color: #FFABAB;">"gwas_snakefile"</span>
<span style="color: #C8FF03;">include</span>: <span style="color: #FFABAB;">"susie_snakefile"</span>
<span style="color: #C8FF03;">include</span>: <span style="color: #FFABAB;">"ldsc_snakefile"</span>
<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">include: "plot_snakefile"</span>

<span style="color: #C8FF03;">include</span>: <span style="color: #FFABAB;">"ukb_snakefile"</span>
<span style="color: #C8FF03;">localrules</span>: cat_grm_bin,cat_grm_N_bin,cat_filef
<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">include: "baseline_ldsc_snakefile" </span>

<span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">all_ukb_traits,= glob_wildcards(config_d["UKB_LDSC"]+"{ukbtrait}.tsv.bgz")</span>
<span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">print(all_ukb_traits[0:10])</span>
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">all</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #B46DCC;">expand</span>(<span style="color: #FFABAB;">"results/{gwas}/{anno_name}.results"</span>,gwas=<span style="color: #FFABAB;">"ptb"</span>,anno_name=<span style="color: #FFABAB;">"tcmdecct"</span>),
        <span style="color: #B46DCC;">expand</span>(<span style="color: #FFABAB;">"singletorus_ptb_{anno}_mv.RDS"</span>,anno=[<span style="color: #FFABAB;">"utme3treatedhic"</span>,<span style="color: #FFABAB;">"tcmdec"</span>,<span style="color: #FFABAB;">"atac"</span>])
<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">expand(config_d["GWAS"]+"gwas_covar_fl_panel/{h2}_{nt}_10",h2=[0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8],nt=[30]),</span>
         <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">expand(config_d["GWAS"]+"gwas_covar_fl_ind/{h2}_{nt}_10",h2=[0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8],nt=[30])</span>

<span style="color: #5D6A70;">#        </span><span style="color: #5D6A70;">expand("results/ukb_noi/{ukb_trait}.log",ukb_trait=all_ukb_traits)</span>
<span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">expand("singletorus_{gwas}_{anno_name}_mv.RDS",gwas=["ptb","fgd"],anno_name=["tcmdec","utme3treatedhic"]),</span>
<span style="color: #5D6A70;">#           </span><span style="color: #5D6A70;">config_d['ANNO'] +"tcmdec.txt.gz",</span>
<span style="color: #5D6A70;">#           </span>

</pre>
</div>
</div>
</div>
