docs/pipeline.html

<div id="outline-container-org142bf13" class="outline-3">
<h3 id="org142bf13">Running FastQTL</h3>
<div class="outline-text-3" id="text-org142bf13">
<p>
I ended up not using fastqtl 
</p>

<div class="org-src-container">
<pre class="src src-snakemake"><span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">prep_covars</span>:
    <span style="color: #99D6FF;">input</span>:
        config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">'covariates/AllColumnNames_final53_PC.txt.gz'</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">HL</span> = <span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: <span style="color: #B46DCC;">str</span>(<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.PCN)+13)
    <span style="color: #99D6FF;">output</span>:
        config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">'covariates/covarlist_{PCN}.txt.gz'</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"zcat {input} | head -n {params.HL} | gzip -c &gt; {output}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">fix_vcf</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">vcf</span>=config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">"genotypes/chr{chrom}.dose.vcf.gz"</span>,
        <span style="color: #FF9326;">samples</span>=config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">"new_id.txt"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">vcf</span>=config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">"genotypes/new_chr{chrom}.dose.vcf.gz"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">bcft</span>=<span style="color: #FFABAB;">"/gpfs/data/xhe-lab/software/spack/opt/spack/linux-redhatenterprisecomputenode6-haswell/gcc-9.2.0/bcftools-1.9-goevgxsrdzddc35cwrixhankcktu4xfj/bin/bcftools"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"{params.bcft} reheader --samples {input.samples} {input.vcf} -o {output.vcf}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">idx_vcf</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">vcf</span>=config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">"genotypes/new_chr{chrom}.dose.vcf.gz"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">idx</span>=config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">"genotypes/new_chr{chrom}.dose.vcf.gz.tbi"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"/gpfs/data/xhe-lab/software/spack/opt/spack/linux-rhel6-haswell/gcc-9.2.0/htslib-1.9-j2ibkw6g7h4v6a5umnfhuwyyk34aldr5/bin/tabix {input.vcf}"</span>

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">format_ldch</span>(elem):
    <span style="color: #C8FF03;">return</span> <span style="color: #B46DCC;">str</span>(elem[<span style="color: #FFABAB;">'chrom'</span>])+<span style="color: #FFABAB;">":"</span>+<span style="color: #B46DCC;">str</span>(elem[<span style="color: #FFABAB;">'start'</span>])+<span style="color: #FFABAB;">'-'</span>+<span style="color: #B46DCC;">str</span>(elem[<span style="color: #FFABAB;">'end'</span>])

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">ldmap_rf</span>(<span style="color: #B46DCC;">wildcards</span>):
    <span style="color: #FF9326;">rchrom</span> = ldetect_data[<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)][<span style="color: #FFABAB;">'chrom'</span>]
    <span style="color: #C8FF03;">return</span> config_d[<span style="color: #FFABAB;">'1KG'</span>] +f<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/h5/1000G.EUR.QC.{rchrom}.h5"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">run_fastqtl_region</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">exp</span>=config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">'phenotypes/Final_GeneExprDetected.7.bed.gz'</span>,
        <span style="color: #FF9326;">cov</span>=<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">'covariates/covarlist_{PCN}.txt.gz'</span>,PCN=<span style="color: #B46DCC;">range</span>(5))
        <span style="color: #FF9326;">samples</span>=config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">'samples.txt'</span>,
        <span style="color: #FF9326;">vcf</span>=<span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">"genotypes/new_chr"</span>+<span style="color: #B46DCC;">str</span>(ldetect_data[<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)][<span style="color: #FFABAB;">'chrom'</span>])+<span style="color: #FFABAB;">".dose.vcf.gz"</span>,
        <span style="color: #FF9326;">vcfi</span>=<span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">"genotypes/new_chr"</span>+<span style="color: #B46DCC;">str</span>(ldetect_data[<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)][<span style="color: #FFABAB;">'chrom'</span>])+<span style="color: #FFABAB;">".dose.vcf.gz.tbi"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">outputf</span>=config_d[<span style="color: #FFABAB;">'OBERF'</span>]+<span style="color: #FFABAB;">'output/{region_id}_{PCN}.txt.gz'</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">region</span> = <span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: format_ldch(ldetect_data[<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)])
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"/gpfs/data/xhe-lab/software/spack/opt/spack/linux-rhel6-haswell/gcc-9.2.0/yesterdayqtl-master-wpcshqtonksv576xlubn5bejtx3vm5ci/bin/fastqtl --vcf {input.vcf} --bed {input.exp} --cov {input.cov} --out {output} -R {params.region} --include-samples {input.samples} "</span>


<span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">rule run_fastqtl_gata2:</span>
<span style="color: #5D6A70;">#     </span><span style="color: #5D6A70;">input:</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">vcf=config_d['OBERF']+'genotypes/new_chr3.dose.vcf.gz',</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">exp=config_d['OBERF']+'phenotypes/Final_GeneExprDetected.7.bed.gz',</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">cov=config_d['OBERF']+'covariates/covarlist_{PCN}.txt.gz',</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">samples=config_d['OBERF']+'samples.txt'</span>
<span style="color: #5D6A70;">#     </span><span style="color: #5D6A70;">output:</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">outputf="fastqtl/GATA2_{PCN}.txt"</span>
<span style="color: #5D6A70;">#     </span><span style="color: #5D6A70;">shell:</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">"/gpfs/data/xhe-lab/software/spack/opt/spack/linux-rhel6-haswell/gcc-9.2.0/yesterdayqtl-master-wpcshqtonksv576xlubn5bejtx3vm5ci/bin/fastqtl --vcf {input.vcf} --bed {input.exp} --cov {input.cov} --out {output} -R 3:128194861-130244735 --include-samples {input.samples} "</span>


<span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">rule run_fastqtl_hand2:</span>
<span style="color: #5D6A70;">#     </span><span style="color: #5D6A70;">input:</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">vcf=config_d['OBERF']+'genotypes/new_chr4.dose.vcf.gz',</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">exp=config_d['OBERF']+'phenotypes/Final_GeneExprDetected.7.bed.gz',</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">cov=config_d['OBERF']+'covariates/covarlist_{PCN}.txt.gz',</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">samples=config_d['OBERF']+'samples.txt'</span>
<span style="color: #5D6A70;">#     </span><span style="color: #5D6A70;">output:</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">outputf="fastqtl/HAND2_{PCN}.txt"</span>
<span style="color: #5D6A70;">#     </span><span style="color: #5D6A70;">shell:</span>
<span style="color: #5D6A70;">#         </span><span style="color: #5D6A70;">"/gpfs/data/xhe-lab/software/spack/opt/spack/linux-rhel6-haswell/gcc-9.2.0/yesterdayqtl-master-wpcshqtonksv576xlubn5bejtx3vm5ci/bin/fastqtl --vcf {input.vcf} --bed {input.exp} --cov {input.cov} --out {output} -R 4:174264132-176570716 --include-samples {input.samples}"</span>

</pre>
</div>
</div>
</div>



<div id="outline-container-org6918ec1" class="outline-3">
<h3 id="org6918ec1">fine mapping with eqtl data</h3>
<div class="outline-text-3" id="text-org6918ec1">
<div class="org-src-container">
<pre class="src src-R">
<span style="color: #C04040;">library</span>(tidyverse)
<span style="color: #C04040;">library</span>(fs)
<span style="color: #C04040;">library</span>(ldmap)
fmap_df <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/scratch/ptb_scratch/ptb_utme3treatedhic.RDS"</span>)


</pre>
</div>
</div>
</div>
