docs/pipeline.html

<div id="outline-container-org24d7988" class="outline-3">
<h3 id="org24d7988">Generating Plots</h3>
<div class="outline-text-3" id="text-org24d7988">
<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">gene_reg</span>(<span style="color: #B46DCC;">wildcards</span>):
    <span style="color: #FF9326;">rchrom</span> = ldetect_data[<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)-1][<span style="color: #FFABAB;">'chrom'</span>]
    <span style="color: #FF9326;">start</span> = ldetect_data[<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)-1][<span style="color: #FFABAB;">'start'</span>]
    <span style="color: #FF9326;">stop</span> = ldetect_data[<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)-1][<span style="color: #FFABAB;">'end'</span>]
    <span style="color: #FF9326;">ret_dict</span> = { <span style="color: #FFABAB;">'chrom'</span>: <span style="color: #FFABAB;">'chr'</span>+<span style="color: #B46DCC;">str</span>(rchrom),
                 <span style="color: #FFABAB;">'start'</span>: start,
                 <span style="color: #FFABAB;">'end'</span>: stop}
    <span style="color: #C8FF03;">return</span> ret_dict


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gene_plot</span>:
      <span style="color: #99D6FF;">params</span>:
          gene_reg
      <span style="color: #99D6FF;">output</span>:
          <span style="color: #FF9326;">outputf</span>=<span style="color: #FFABAB;">"results/plot_data/genes/{region_id}.RDS"</span>,
          <span style="color: #FF9326;">genelistf</span>=<span style="color: #FFABAB;">"results/plot_data/genes/{region_id}_genelist.txt.gz"</span>
      <span style="color: #99D6FF;">script</span>:
          <span style="color: #FFABAB;">"../scripts/ldmr_geneplot_data.R"</span>


<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">anno_plot_fun</span>(<span style="color: #B46DCC;">wildcards</span>):
    <span style="color: #FF9326;">anno_name</span> = <span style="color: #B46DCC;">wildcards</span>.anno_name
    <span style="color: #FF9326;">region_id</span> = <span style="color: #B46DCC;">wildcards</span>.region_id
    <span style="color: #FF9326;">hicm</span> = re.<span style="color: #B46DCC;">compile</span>(<span style="color: #FFABAB;">'^hic'</span>)
    <span style="color: #FF9326;">annol</span> = all_annot[<span style="color: #FFABAB;">'ptb_torus_model'</span>].get(anno_name)
    <span style="color: #C8FF03;">print</span>(annol)
    <span style="color: #FF9326;">annok</span> = [x <span style="color: #C8FF03;">for</span> x <span style="color: #C8FF03;">in</span> annol <span style="color: #C8FF03;">if</span> <span style="color: #C8FF03;">not</span> hicm.match(x)]
    <span style="color: #FF9326;">ret_dict</span> = {
        <span style="color: #FFABAB;">'annof'</span> : anno_files(annok )
    }
    <span style="color: #C8FF03;">return</span> ret_dict


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">anno_data_plot</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #B46DCC;">unpack</span>(anno_plot_fun)
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">anno_names</span>= <span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: [x <span style="color: #C8FF03;">for</span> x <span style="color: #C8FF03;">in</span> all_annot[<span style="color: #FFABAB;">'ptb_torus_model'</span>].get(<span style="color: #B46DCC;">wildcards</span>.anno_name) <span style="color: #C8FF03;">if</span> <span style="color: #C8FF03;">not</span> re.<span style="color: #B46DCC;">compile</span>(<span style="color: #FFABAB;">'^hic'</span>).match(x)],
        <span style="color: #FF9326;">region_id</span>=<span style="color: #FFABAB;">"{region_id}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">anno</span>=<span style="color: #FFABAB;">"results/plot_data/anno/{anno_name}_{region_id}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/ldmr_annoplot_data.R"</span>



<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gwas_p_data_plot</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">pipf</span> = config_d[<span style="color: #FFABAB;">'FINEMAP'</span>]+<span style="color: #FFABAB;">"torus_{gwas}_{anno_name}/{region_id}.RDS"</span>,
        <span style="color: #FF9326;">gwasf</span> = config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"{gwas}_gwas.h5"</span>,
        <span style="color: #FF9326;">ldgf</span> = config_d[<span style="color: #FFABAB;">'GWAS'</span>]+ <span style="color: #FFABAB;">"{gwas}_gwas_ldetect.RDS"</span>,
        <span style="color: #FF9326;">priorf</span> = config_d[<span style="color: #FFABAB;">'ANNO'</span>] +<span style="color: #FFABAB;">"torus_{gwas}_{anno_name}/{region_id}.RDS"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">region_id</span>=<span style="color: #FFABAB;">"{region_id}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">gwas</span>=<span style="color: #FFABAB;">"results/plot_data/susie/{gwas}_{anno_name}_{region_id}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/ldmr_pplot_data.R"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gwas_np_data_plot</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">pipf</span> = config_d[<span style="color: #FFABAB;">'FINEMAP'</span>]+<span style="color: #FFABAB;">"torus_ptb/{region_id}.RDS"</span>,
        <span style="color: #FF9326;">gwasf</span> = config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"ptb_gwas.h5"</span>,
        <span style="color: #FF9326;">ldgf</span> = config_d[<span style="color: #FFABAB;">'GWAS'</span>]+ <span style="color: #FFABAB;">"ptb_gwas_ldetect.RDS"</span>,
        <span style="color: #FF9326;">priorf</span> = config_d[<span style="color: #FFABAB;">'ANNO'</span>] +<span style="color: #FFABAB;">"torus_ptb/{region_id}.RDS"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">region_id</span>=<span style="color: #FFABAB;">"{region_id}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">gwas</span>=<span style="color: #FFABAB;">"plot_data/susie/ptb_{region_id}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/ldmr_pplot_data.R"</span>



<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">hic_data_plot</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">hic</span>=config_d[<span style="color: #FFABAB;">'BED'</span>]+<span style="color: #FFABAB;">"DT1_dTL4_D_48h.ibed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">region_id</span>=<span style="color: #FFABAB;">"{region_id}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">hic</span>=<span style="color: #FFABAB;">"plot_data/hic/{region_id}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/ldmr_hicplot_data.R"</span>




<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">ldplot</span>(<span style="color: #B46DCC;">wildcards</span>):
    <span style="color: #FF9326;">regid</span> = <span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)
    <span style="color: #FF9326;">rchrom</span> = ldetect_data[regid][<span style="color: #FFABAB;">'chrom'</span>]
    <span style="color: #C8FF03;">return</span> {<span style="color: #FFABAB;">'ldhf'</span>: config_d[<span style="color: #FFABAB;">'1KG'</span>]+f<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/LD/{rchrom}_{regid}.h5"</span>}


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">ld_data_plot</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #B46DCC;">unpack</span>(ldplot)
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">region_id</span>=<span style="color: #FFABAB;">"{region_id}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">plotf</span>=<span style="color: #FFABAB;">"plot/LD/{region_id}.RDS"</span>,
        <span style="color: #FF9326;">dataf</span>=<span style="color: #FFABAB;">"plot_data/LD/{region_id}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/ldmr_ldplot.R"</span>


</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
<span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(tidyr)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(ggplot2)
<span style="color: #C04040;">library</span>(ldmap)
<span style="color: #C04040;">library</span>(EigenH5)
<span style="color: #C04040;">library</span>(Matrix)

inputf <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"ldhf"</span>]]


saveRDS(filter(df,r2 &gt; 0.1),snakemake@output[[<span style="color: #FFABAB;">"dataf"</span>]])
ld_plot  <span style="color: #C04040;">&lt;-</span> filter(df,r2 &gt; 0.1) <span style="color: #C04040;">%&gt;%</span> ggplot() +
  geom_point(aes(positions(isnp) + y, y, color = r2, alpha = r2), size = rel(0.5)) +
  theme(axis.text.y = element_blank(),
        axis.ticks.y = element_blank()) +
  labs(x = <span style="color: #FFABAB;">"Position"</span>, y = <span style="color: #99D6FF;">NULL</span>) +
  scale_alpha(guide = <span style="color: #FFABAB;">'none'</span>)
saveRDS(ld_plot,snakemake@output[[<span style="color: #FFABAB;">"plotf"</span>]])


</pre>
</div>
</div>
