docs/pipeline.html


<div id="outline-container-orge7f231e" class="outline-4">
<h4 id="orge7f231e">Gene data</h4>
<div class="outline-text-4" id="text-orge7f231e">
<div class="org-src-container">
<pre class="src src-R">
<span style="color: #C04040;">library</span>(stringr)
<span style="color: #C04040;">library</span>(Homo.sapiens)
<span style="color: #C04040;">library</span>(RColorBrewer)

<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(biovizBase)
<span style="color: #C04040;">library</span>(Homo.sapiens)
<span style="color: #C04040;">library</span>(readr)

txdb <span style="color: #C04040;">&lt;-</span> TxDb(Homo.sapiens)

chrp <span style="color: #C04040;">&lt;-</span> snakemake@params[[1]][[<span style="color: #FFABAB;">"chrom"</span>]]
stopifnot(!is.null(chrp))

start <span style="color: #C04040;">&lt;-</span> snakemake@params[[1]][[<span style="color: #FFABAB;">"start"</span>]]
stopifnot(!is.null(start))
start <span style="color: #C04040;">&lt;-</span> as.integer(start)

end <span style="color: #C04040;">&lt;-</span> snakemake@params[[1]][[<span style="color: #FFABAB;">"end"</span>]]
stopifnot(!is.null(end))
end <span style="color: #C04040;">&lt;-</span> as.integer(end)

gr <span style="color: #C04040;">&lt;-</span> GenomicRanges::GRanges(seqnames = chrp,ranges=IRanges::IRanges(start = start,end = end))

suppressMessages(tg_df <span style="color: #C04040;">&lt;-</span>
                   OrganismDbi::selectByRanges(
                                  x = Homo.sapiens,
                                  ranges = gr,
                                  columns = c(<span style="color: #FFABAB;">"SYMBOL"</span>, <span style="color: #FFABAB;">"TXNAME"</span>)) <span style="color: #C04040;">%&gt;%</span>
                   as_tibble() <span style="color: #C04040;">%&gt;%</span>
                   dplyr::select(tx_name = TXNAME, symbol = SYMBOL) <span style="color: #C04040;">%&gt;%</span>
                   tidyr::unnest(cols = c(tx_name, symbol)))

suppressMessages(gr.txdb <span style="color: #C04040;">&lt;-</span>
                   crunch(txdb, which = gr) <span style="color: #C04040;">%&gt;%</span>
                   as_tibble() <span style="color: #C04040;">%&gt;%</span>
                   mutate(tx_name = as.character(tx_name)) <span style="color: #C04040;">%&gt;%</span>
                   inner_join(tg_df) <span style="color: #C04040;">%&gt;%</span>
                   plyranges::as_granges() <span style="color: #C04040;">%&gt;%</span>
                   split(.$symbol))

dplyr::as_tibble(tg_df) <span style="color: #C04040;">%&gt;%</span> distinct(symbol) <span style="color: #C04040;">%&gt;%</span> write_tsv(snakemake@output[[<span style="color: #FFABAB;">"genelistf"</span>]])
saveRDS(unlist(gr.txdb),snakemake@output[[<span style="color: #FFABAB;">"outputf"</span>]])


</pre>
</div>
</div>
</div>
