docs/pipeline.html

<div id="outline-container-orge0a35eb" class="outline-4">
<h4 id="orge0a35eb">Anno data</h4>
<div class="outline-text-4" id="text-orge0a35eb">
<div class="org-src-container">
<pre class="src src-R">

anno_files <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"annof"</span>]]
anno_names <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"anno_names"</span>]]
regid <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"region_id"</span>]]

  <span style="color: #C04040;">library</span>(ldmap)
  <span style="color: #C04040;">library</span>(stringr)
  <span style="color: #C04040;">library</span>(EigenH5)
  <span style="color: #C04040;">library</span>(tidyr)
  <span style="color: #C04040;">library</span>(vroom)
  <span style="color: #C04040;">library</span>(purrr)
  <span style="color: #C04040;">library</span>(dplyr)

  <span style="color: #FFE203;">anno_dff</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(anno_files, anno_names, ldmrid) {
    map2_dfr(anno_files, anno_names, <span style="color: #C8FF03;">function</span>(x, y) {
      read_bed(x, read_fun = purrr::partial(vroom::vroom, delim = <span style="color: #FFABAB;">"     "</span>)) <span style="color: #C04040;">%&gt;%</span>
        dplyr::filter(region_in_region(ldmap_region, ldetect_EUR,<span style="color: #99D6FF;">TRUE</span>) == ldmrid) <span style="color: #C04040;">%&gt;%</span>
        mutate(anno = y)
    }) <span style="color: #C04040;">%&gt;%</span> mutate(ldmap_region=as_ldmap_region(ldmap_region))
  }




  stopifnot(!is.null(regid))


  anno_result_df <span style="color: #C04040;">&lt;-</span> anno_dff(anno_files, anno_names, as.integer(regid))



  saveRDS(anno_result_df, snakemake@output[[<span style="color: #FFABAB;">"anno"</span>]])

</pre>
</div>




<div class="org-src-container">
<pre class="src src-R">

    pipf <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"pipf"</span>]]
    gwasf <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"gwasf"</span>]]
    ldgf <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"ldgf"</span>]]
    regid <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"region_id"</span>]]
    priorf <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"priorf"</span>]]


<span style="color: #5D6A70;">#    </span><span style="color: #5D6A70;">#source("renv/activate.R")</span>
    <span style="color: #C04040;">library</span>(stringr)
    <span style="color: #C04040;">library</span>(EigenH5)
    <span style="color: #C04040;">library</span>(ldmap)
    <span style="color: #C04040;">library</span>(readr)
    <span style="color: #C04040;">library</span>(tidyr)
    <span style="color: #C04040;">library</span>(vroom)
    <span style="color: #C04040;">library</span>(purrr)
    <span style="color: #C04040;">library</span>(dplyr)



    <span style="color: #FFE203;">merge_gwas_susie</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(gwas_h5, ldetect_rds, susie_rds, ldmrid, prior_rds) {
        stopifnot(
            !is.null(gwas_h5),
            !is.null(ldetect_rds),
            !is.null(susie_rds),
            all(file.exists(c(
                gwas_h5,
                ldetect_rds,
                susie_rds
            )))
        )

        susie_res <span style="color: #C04040;">&lt;-</span> readRDS(susie_rds)
        ldr <span style="color: #C04040;">&lt;-</span> readRDS(ldetect_rds) <span style="color: #C04040;">%&gt;%</span> slice(ldmrid)
        gwas_df <span style="color: #C04040;">&lt;-</span> read_df_h5(gwas_h5,
            <span style="color: #FFABAB;">"snp"</span>,
            subcols = c(<span style="color: #FFABAB;">"snp_struct"</span>, <span style="color: #FFABAB;">"pval"</span>),
            offset = as.integer(ldr$offset),
            datasize = as.integer(ldr$datasize)
        )
        prior_df <span style="color: #C04040;">&lt;-</span> readRDS(prior_rds)
        <span style="color: #C8FF03;">if</span> (typeof(prior_df$SNP) == <span style="color: #FFABAB;">"character"</span>) {
            prior_df <span style="color: #C04040;">&lt;-</span> prior_df <span style="color: #C04040;">%&gt;%</span>
                separate(SNP, c(<span style="color: #FFABAB;">"chrom"</span>, <span style="color: #FFABAB;">"pos"</span>, <span style="color: #FFABAB;">"ref"</span>, <span style="color: #FFABAB;">"alt"</span>), convert = <span style="color: #99D6FF;">TRUE</span>) <span style="color: #C04040;">%&gt;%</span>
                dplyr::mutate(chrom = as.integer(stringr::str_replace(chrom, <span style="color: #FFABAB;">"chr"</span>, <span style="color: #FFABAB;">""</span>))) <span style="color: #C04040;">%&gt;%</span>
                compact_snp_struct(snp_struct = <span style="color: #FFABAB;">"SNP"</span>)
        }
        ret_match <span style="color: #C04040;">&lt;-</span> dplyr::bind_cols(gwas_df, join_snp(
            gwas_df$snp_struct,
            prior_df$SNP
        )) <span style="color: #C04040;">%&gt;%</span>
            filter(!is.na(index)) <span style="color: #C04040;">%&gt;%</span>
            dplyr::select(snp_struct = match, index, pval)
        ret_match$prior <span style="color: #C04040;">&lt;-</span> prior_df$prior[ret_match$index]

        stopifnot(
            all(snp_in_region(range(ret_match$snp_struct), ldetect_EUR) == ldmrid),
            length(susie_res$alpha) == nrow(ret_match)
        )
        ret_match <span style="color: #C04040;">&lt;-</span> dplyr::select(ret_match, -index) <span style="color: #C04040;">%&gt;%</span>
            dplyr::mutate(pip = susie_res$pip, CS = <span style="color: #99D6FF;">FALSE</span>)
        <span style="color: #C8FF03;">if</span>(length(susie_res$sets$cs)!=1)
          <span style="color: #C8FF03;">return</span>(ret_match)
        stopifnot(length(susie_res$sets$cs) == 1)
        ret_match$CS[susie_res$sets$cs[[1]]] <span style="color: #C04040;">&lt;-</span> <span style="color: #99D6FF;">TRUE</span>
        <span style="color: #C8FF03;">return</span>(ret_match)
    }




    stopifnot(!is.null(regid))

    gwas_result_df <span style="color: #C04040;">&lt;-</span> merge_gwas_susie(gwasf, ldgf, pipf, as.integer(regid), priorf)

    saveRDS(gwas_result_df, snakemake@output[[<span style="color: #FFABAB;">"gwas"</span>]])

</pre>
</div>




<div class="org-src-container">
<pre class="src src-R">
    hic_file <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"hic"</span>]]
    regid <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"region_id"</span>]]


<span style="color: #5D6A70;">#    </span><span style="color: #5D6A70;">#source("renv/activate.R")</span>
    <span style="color: #C04040;">library</span>(stringr)
    <span style="color: #C04040;">library</span>(readr)
    <span style="color: #C04040;">library</span>(EigenH5)
    <span style="color: #C04040;">library</span>(ldmap)
    <span style="color: #C04040;">library</span>(tidyr)
    <span style="color: #C04040;">library</span>(vroom)
    <span style="color: #C04040;">library</span>(purrr)
    <span style="color: #C04040;">library</span>(dplyr)

    <span style="color: #FFE203;">hic_anno_dff</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(hic_file, ldmrid) {
        cold <span style="color: #C04040;">&lt;-</span> cols(
            bait_chr = col_factor(paste0(<span style="color: #FFABAB;">"chr"</span>, c(as.character(1:22), c(<span style="color: #FFABAB;">"X"</span>, <span style="color: #FFABAB;">"Y"</span>)))),
            bait_start = col_double(),
            bait_end = col_double(),
            bait_name = col_character(),
            otherEnd_chr = col_factor(paste0(<span style="color: #FFABAB;">"chr"</span>, c(as.character(1:22), c(<span style="color: #FFABAB;">"X"</span>, <span style="color: #FFABAB;">"Y"</span>)))),
            otherEnd_start = col_double(),
            otherEnd_end = col_double(),
            otherEnd_name = col_character(),
            N_reads = col_double(),
            score = col_double()
        )
        ldmr <span style="color: #C04040;">&lt;-</span> ldetect_EUR[ldmrid]
        read_tsv(hic_file, col_names = names(cold$cols), col_types = cold, skip = 1L) <span style="color: #C04040;">%&gt;%</span>
            filter(bait_chr != <span style="color: #FFABAB;">"chrY"</span>, otherEnd_chr != <span style="color: #FFABAB;">"chrY"</span>) <span style="color: #C04040;">%&gt;%</span>
            compact_ldmap_region(chrom = <span style="color: #FFABAB;">"bait_chr"</span>, start = <span style="color: #FFABAB;">"bait_start"</span>, end = <span style="color: #FFABAB;">"bait_end"</span>, ldmap_region = <span style="color: #FFABAB;">"bait"</span>) <span style="color: #C04040;">%&gt;%</span>
            compact_ldmap_region(chrom = <span style="color: #FFABAB;">"otherEnd_chr"</span>, start = <span style="color: #FFABAB;">"otherEnd_start"</span>, end = <span style="color: #FFABAB;">"otherEnd_end"</span>, ldmap_region = <span style="color: #FFABAB;">"target"</span>) <span style="color: #C04040;">%&gt;%</span>
            filter(!is.na(region_in_region(bait,ldmr,<span style="color: #99D6FF;">TRUE</span>)), !is.na(region_in_region(target,ldmr,<span style="color: #99D6FF;">TRUE</span>)))
    }

    stopifnot(!is.null(regid))

    hic_result_df <span style="color: #C04040;">&lt;-</span> hic_anno_dff(hic_file,as.integer(regid))

    saveRDS(hic_result_df, snakemake@output[[<span style="color: #FFABAB;">"hic"</span>]])
</pre>
</div>


<div class="org-src-container">
<pre class="src src-R"><span style="color: #5D6A70;">#  </span><span style="color: #5D6A70;">#source("renv/activate.R")</span>

  <span style="color: #C04040;">library</span>(stringr)
  <span style="color: #C04040;">library</span>(readr)
  <span style="color: #C04040;">library</span>(EigenH5)
  <span style="color: #C04040;">library</span>(ldmap)
  <span style="color: #C04040;">library</span>(tidyr)
  <span style="color: #C04040;">library</span>(vroom)
  <span style="color: #C04040;">library</span>(purrr)
  <span style="color: #C04040;">library</span>(dplyr)

  anno_file <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"anno_file"</span>]]
  region <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"region"</span>]]
  hic_file <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"hic"</span>]]
  null_file <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"null_file"</span>]]
  alt_file <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"alt_file"</span>]]

  pip_df <span style="color: #C04040;">&lt;-</span> inner_join(readRDS(null_file),
                       readRDS(alt_file),
                       by = c(<span style="color: #FFABAB;">"snp_struct"</span>,<span style="color: #FFABAB;">"pval"</span>),
                       suffix = c(<span style="color: #FFABAB;">"_null"</span>,<span style="color: #FFABAB;">"_model"</span>)) <span style="color: #C04040;">%&gt;%</span>
    mutate(region_id = region)

  tfr <span style="color: #C04040;">&lt;-</span> pip_df <span style="color: #C04040;">%&gt;%</span>
    dplyr::arrange(snp_struct) <span style="color: #C04040;">%&gt;%</span>
    dplyr::mutate(lrmax = pmin(cummax(pip_model),rev(cummax(rev(pip_model))))) <span style="color: #C04040;">%&gt;%</span>
     dplyr::filter(lrmax &gt; 1e-6)  <span style="color: #C04040;">%&gt;%</span> dplyr::pull(snp_struct)  <span style="color: #C04040;">%&gt;%</span> convex_hull()

    cs_df <span style="color: #C04040;">&lt;-</span>  dplyr::filter(pip_df,CS_model==<span style="color: #99D6FF;">TRUE</span>)

  anno_df <span style="color: #C04040;">&lt;-</span> readRDS(anno_file) <span style="color: #C04040;">%&gt;%</span>
      mutate(region_id = region) <span style="color: #C04040;">%&gt;%</span>
      dplyr::filter(is_region_in_region(ldmap_region, tfr))

  hic_df <span style="color: #C04040;">&lt;-</span> readRDS(hic_file) <span style="color: #C04040;">%&gt;%</span>
      dplyr::mutate(region_id = y) <span style="color: #C04040;">%&gt;%</span>
    dplyr::filter(is_region_in_region(bait, tfr), is_region_in_region(target, tfr))

  bait_df <span style="color: #C04040;">&lt;-</span> dplyr::select(hic_df, ldmap_region = bait,
                           region_id) <span style="color: #C04040;">%&gt;%</span>
    mutate(anno = <span style="color: #FFABAB;">"DSC_Treated_HiC"</span>)

  target_df <span style="color: #C04040;">&lt;-</span> dplyr::select(hic_df, ldmap_region = target,
                             region_id) <span style="color: #C04040;">%&gt;%</span>
    mutate(anno = <span style="color: #FFABAB;">"DSC_Treated_HiC"</span>)

  plot_df <span style="color: #C04040;">&lt;-</span> bind_rows(anno_df,
                       bait_df,
                       target_df) <span style="color: #C04040;">%&gt;%</span>
    mutate(ldmap_region = as_ldmap_region(ldmap_region))


  <span style="color: #FFE203;">midpoints</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(x) {
      stopifnot(inherits(x, <span style="color: #FFABAB;">"ldmap_region"</span>))
      <span style="color: #C8FF03;">return</span>(starts(x) + round((ends(x) - starts(x)) / 2))
  }
  <span style="color: #FFE203;">widths</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(x) {
      stopifnot(inherits(x, <span style="color: #FFABAB;">"ldmap_region"</span>))
      <span style="color: #C8FF03;">return</span>(ends(x) - starts(x))
  }

  hlinel <span style="color: #C04040;">&lt;-</span> map(positions(cd_df$snp_struct), ~ geom_vline(xintercept = .x, col = <span style="color: #FFABAB;">"red"</span>, alpha = 0.2))

  <span style="color: #FFE203;">add_plots</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(proto, plot_list) {
      purrr::reduce(plot_list, <span style="color: #EDEDE1; background-color: #272C2E;">`+`</span>, .init = proto)
  }

  <span style="color: #FFE203;">hicplotf</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(reg) {
      fl <span style="color: #C04040;">&lt;-</span> focus_l[[reg]]

      hml <span style="color: #C04040;">&lt;-</span> hlinemapl[[reg]]
      df <span style="color: #C04040;">&lt;-</span> focus_hic_l[[reg]]

      tannogr <span style="color: #C04040;">&lt;-</span> focus_full_anno_l[[reg]] <span style="color: #C04040;">%&gt;%</span> dplyr::mutate(
          feature = str_remove(anno, <span style="color: #FFABAB;">"^.+dec-"</span>),
          feature = str_remove(feature, <span style="color: #FFABAB;">"DSC_Treated_"</span>),
          feat_fact = factor(feature)
      )

      df <span style="color: #C04040;">&lt;-</span> dplyr::mutate(df, feat_fact = factor(<span style="color: #FFABAB;">"HiC"</span>, levels = levels(tannogr$feat_fact)))

      annoplot <span style="color: #C04040;">&lt;-</span> ggplot() +
          geom_tile(
              data = tannogr,
              aes(
                  x = midpoints(ldmap_region),
                  y = feat_fact,
                  width = widths(ldmap_region)
              ),
              height = .5
          ) +
          geom_curve(data = df, aes(
              x = midpoints(bait),
              y = feat_fact,
              xend = midpoints(target),
              yend = feat_fact
          )) +
          ylab(<span style="color: #FFABAB;">"Functional Genomic Annotation"</span>) +
          xlab(<span style="color: #FFABAB;">"Position"</span>) +
          xlim(c(starts(fl), ends(fl)))
      add_plots(annoplot, hml)
  }

  genel <span style="color: #C04040;">&lt;-</span> map(havegene_list, <span style="color: #C8FF03;">function</span>(reg) {
      fl <span style="color: #C04040;">&lt;-</span> focus_l[[reg]]
      x <span style="color: #C04040;">&lt;-</span> focus_grtm[[reg]]
      y <span style="color: #C04040;">&lt;-</span> hlinemapl[[reg]]
      add_plots(x@ggplot + ylab(<span style="color: #FFABAB;">"Genes"</span>) + xlim(c(starts(fl), ends(fl))), y)
  })
  fmplots <span style="color: #C04040;">&lt;-</span> list(gene = genel, anno = hicplots, ld = lddfl_vl) <span style="color: #C04040;">%&gt;%</span> pmap(<span style="color: #C8FF03;">function</span>(gene, anno, ld) {
      (anno / gene / ld)
  })
  plan(multiprocess)

  od <span style="color: #C04040;">&lt;-</span> <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/MOD paper 1/Fine_Mapping/"</span>
  future_walk(seq_along(fmplots), <span style="color: #C8FF03;">function</span>(i) {
      plt <span style="color: #C04040;">&lt;-</span> fmplots[[i]]
      name <span style="color: #C04040;">&lt;-</span> havegene_list[i]
      output_png <span style="color: #C04040;">&lt;-</span> fs::path(name, ext = <span style="color: #FFABAB;">"png"</span>)
      ggsave(filename = output_png, plot = plt, path = od)
  })


    <span style="color: #C04040;">library</span>(EigenH5)
    cols <span style="color: #C04040;">&lt;-</span> rev(grDevices::colorRampPalette(c(<span style="color: #FFABAB;">"#41AB5D"</span>,<span style="color: #FFABAB;">"#BDBDBD"</span>),
                                    space = <span style="color: #FFABAB;">"Lab"</span>)(200))
    ld_files <span style="color: #C04040;">&lt;-</span> fs::dir_ls(<span style="color: #FFABAB;">"~/tmp/LD/"</span>,glob=<span style="color: #FFABAB;">"*h5"</span>)
    ld_region <span style="color: #C04040;">&lt;-</span> str_replace(ld_files,<span style="color: #FFABAB;">".+/[0-9]+_([0-9]+).h5"</span>,<span style="color: #FFABAB;">"\\1"</span>)
    ldf_df <span style="color: #C04040;">&lt;-</span> tibble(inputf=ld_files,region=ld_region) <span style="color: #C04040;">%&gt;%</span> dplyr::filter(region <span style="color: #C04040;">%in%</span> names(focus_l))
    lddfl <span style="color: #C04040;">&lt;-</span> pmap(ldf_df,<span style="color: #C8FF03;">function</span>(inputf,region){
      tfoc <span style="color: #C04040;">&lt;-</span> focus_l[[region]]
      tmpdf <span style="color: #C04040;">&lt;-</span> read_df_h5(inputf,<span style="color: #FFABAB;">"snp"</span>)
      tmpR <span style="color: #C04040;">&lt;-</span> read_matrix_h5(inputf,<span style="color: #FFABAB;">"R"</span>)
      tmpT <span style="color: #C04040;">&lt;-</span> as(tmpR, <span style="color: #FFABAB;">"dgTMatrix"</span>)
      upper <span style="color: #C04040;">&lt;-</span> (tmpT@i &lt;= tmpT@j)
      df <span style="color: #C04040;">&lt;-</span> tibble(
        i = tmpT@i[upper], 
        j = tmpT@j[upper],
        r2 = tmpT@x[upper]^2
      ) <span style="color: #C04040;">%&gt;%</span> 
        mutate(isnp = tmpdf$snp_struct[i + 1],jsnp = tmpdf$snp_struct[j + 1]) <span style="color: #C04040;">%&gt;%</span> filter(positions(i) &lt;=  positions(j)) <span style="color: #C04040;">%&gt;%</span> 
        mutate(y = (positions(jsnp) - positions(isnp)) / 2) <span style="color: #C04040;">%&gt;%</span> 
        dplyr::filter(is_snp_in_region(isnp,tfoc),is_snp_in_region(jsnp,tfoc)) <span style="color: #C04040;">%&gt;%</span>
        ggplot() +
        geom_point(aes(positions(isnp) + y, y, color = r2, alpha = r2), size = rel(0.5)) +
        scale_color_gradientn(colours=cols) +
        theme(axis.text.y = element_blank(),
              axis.ticks.y = element_blank()) +
        labs(x = <span style="color: #FFABAB;">"Position"</span>, y = <span style="color: #99D6FF;">NULL</span>) +
        scale_alpha(guide = <span style="color: #FFABAB;">'none'</span>)
    }) <span style="color: #C04040;">%&gt;%</span> set_names(ldf_df$region)

      focus_gr_list <span style="color: #C04040;">&lt;-</span> map(focus_l,<span style="color: #C8FF03;">function</span>(ldmr) {
          chrp  <span style="color: #C04040;">&lt;-</span> paste0(<span style="color: #FFABAB;">"chr"</span>,chromosomes(ldmr))
          start <span style="color: #C04040;">&lt;-</span> starts(ldmr)
          end <span style="color: #C04040;">&lt;-</span> ends(ldmr)

          <span style="color: #C8FF03;">return</span>(GenomicRanges::GRanges(seqnames = chrp,ranges=IRanges::IRanges(start = start,end = end)))
        })
        focus_tgdl <span style="color: #C04040;">&lt;-</span> map(focus_gr_list,<span style="color: #C8FF03;">function</span>(gr) {
          suppressMessages(tg_df <span style="color: #C04040;">&lt;-</span>
                             OrganismDbi::selectByRanges(
                                            x = Homo.sapiens,
                                            ranges = gr,
                                            columns = c(<span style="color: #FFABAB;">"SYMBOL"</span>, <span style="color: #FFABAB;">"TXNAME"</span>)) <span style="color: #C04040;">%&gt;%</span>
                             as_tibble() <span style="color: #C04040;">%&gt;%</span>
                             dplyr::select(tx_name = TXNAME, symbol = SYMBOL) <span style="color: #C04040;">%&gt;%</span>
                             tidyr::unnest(cols = c(tx_name, symbol)))
          <span style="color: #C8FF03;">return</span>(tg_df)
        })

      <span style="color: #FFE203;">genefun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(tg_df,gr) {
        <span style="color: #C8FF03;">if</span>(nrow(tg_df)&gt;0){
          suppressMessages(gr.txdb <span style="color: #C04040;">&lt;-</span>
                             crunch(txdb, which = gr) <span style="color: #C04040;">%&gt;%</span>
                             tibble::as_tibble() <span style="color: #C04040;">%&gt;%</span>
                             dplyr::mutate(tx_name = as.character(tx_name)) <span style="color: #C04040;">%&gt;%</span>
                             dplyr::inner_join(tg_df) <span style="color: #C04040;">%&gt;%</span>
                             plyranges::as_granges() <span style="color: #C04040;">%&gt;%</span>
                             split(.$symbol))
        }<span style="color: #C8FF03;">else</span>{
          gr.txdb <span style="color: #C04040;">&lt;-</span> GenomicRangesList()
          <span style="color: #C8FF03;">return</span>(gr.txdb)
        }
      }


      focus_grtl <span style="color: #C04040;">&lt;-</span> map2(focus_tgdl, focus_gr_list, genefun)  <span style="color: #C04040;">%&gt;%</span> purrr::discard(~class(.x)==<span style="color: #FFABAB;">"SimpleGenomicRangesList"</span>)
      focus_grtm <span style="color: #C04040;">&lt;-</span> map(focus_grtl,autoplot)
      length(focus_grtl)

    txdb <span style="color: #C04040;">&lt;-</span> TxDb(Homo.sapiens)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">  input_st
  inputf <span style="color: #C04040;">&lt;-</span> dir(<span style="color: #FFABAB;">"/tmp"</span>,pattern=<span style="color: #FFABAB;">"*bw"</span>,full.names=<span style="color: #99D6FF;">TRUE</span>)
  susie_d <span style="color: #C04040;">&lt;-</span> <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/output/results/plot_data/susie"</span>
  susie_f <span style="color: #C04040;">&lt;-</span> <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/output/results/plot_data/susie/ptb_treatedhic_512.RDS"</span>
  susie_nullf <span style="color: #C04040;">&lt;-</span> <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/output/results/plot_data/susie/ptb_512.RDS"</span>

  pip_df <span style="color: #C04040;">&lt;-</span> dplyr::inner_join(readRDS(susie_nullf),
                       readRDS(susie_f),by = c(<span style="color: #FFABAB;">"snp_struct"</span>,<span style="color: #FFABAB;">"pval"</span>),suffix = c(<span style="color: #FFABAB;">"_null"</span>,<span style="color: #FFABAB;">"_model"</span>))
  f_pip_df <span style="color: #C04040;">&lt;-</span> pip_df <span style="color: #C04040;">%&gt;%</span>  dplyr::arrange(snp_struct) <span style="color: #C04040;">%&gt;%</span> dplyr::mutate(lrmax = pmin(cummax(pmax(pip_model,pip_null)),rev(cummax(rev(pmax(pip_null,pip_model))))))
  fm_region <span style="color: #C04040;">&lt;-</span> dplyr::filter(f_pip_df,lrmax &gt; 1e-6)  <span style="color: #C04040;">%&gt;%</span> dplyr::pull(snp_struct)  <span style="color: #C04040;">%&gt;%</span> convex_hull()
  region_r <span style="color: #C04040;">&lt;-</span> fm_region
  x <span style="color: #C04040;">&lt;-</span> inputf[1]

  <span style="color: #C04040;">library</span>(rtracklayer)
  <span style="color: #C04040;">library</span>(ldmap)
  <span style="color: #C04040;">library</span>(fs)
  <span style="color: #C04040;">library</span>(purrr)
  <span style="color: #C04040;">library</span>(dplyr)
  <span style="color: #C04040;">library</span>(stringr)
  <span style="color: #C04040;">library</span>(plyranges)
  <span style="color: #C04040;">library</span>(Gviz)


  <span style="color: #C04040;">library</span>(biovizBase)
  <span style="color: #C04040;">library</span>(Homo.sapiens)
  <span style="color: #C04040;">library</span>(readr)


  <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">exp &lt;- example_HiC()</span>
  <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">inputf &lt;- snakemake@input[["bigwigs"]]</span>
  fnames <span style="color: #C04040;">&lt;-</span> fs::path_ext_remove((fs::path_file(inputf)))
  mark <span style="color: #C04040;">&lt;-</span>  str_remove(fnames,<span style="color: #FFABAB;">"DSC[0-9]-.+-"</span>)
  treatment <span style="color: #C04040;">&lt;-</span>  str_replace(fnames,<span style="color: #FFABAB;">"DSC[0-9]-(.+)-.+"</span>,<span style="color: #FFABAB;">"\\1"</span>)
  (sample <span style="color: #C04040;">&lt;-</span>  str_replace(fnames,<span style="color: #FFABAB;">"(DSC[0-9])-(.+)-.+"</span>,<span style="color: #FFABAB;">"\\1"</span>))
  input_df <span style="color: #C04040;">&lt;-</span> tibble::tibble(file=inputf,name=fnames,mark=mark,treatment=treatment,sample=sample)
  <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">region &lt;- 356L</span>
  <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">region_r &lt;- ldetect_EUR[region]</span>
  <span style="color: #C04040;">library</span>(biomaRt)
  bm <span style="color: #C04040;">&lt;-</span> useMart(host=<span style="color: #FFABAB;">"grch37.ensembl.org"</span>, biomart=<span style="color: #FFABAB;">"ENSEMBL_MART_ENSEMBL"</span>, dataset=<span style="color: #FFABAB;">"hsapiens_gene_ensembl"</span>)

  <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">dTrack2 &lt;- Gviz::DataTrack(range=x, genome="hg19", type="l", chromosome=paste0("chr",chromosomes(region_r)), name="bigwig")</span>


  <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">Gviz::plotTracks(dTrack2,from=starts(region_r),to=ends(region_r))</span>
  <span style="color: #FFE203;">focus_gr</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(ldmr){
    chrp  <span style="color: #C04040;">&lt;-</span> paste0(<span style="color: #FFABAB;">"chr"</span>,chromosomes(ldmr))
    start <span style="color: #C04040;">&lt;-</span> starts(ldmr)
    end <span style="color: #C04040;">&lt;-</span> ends(ldmr)

    <span style="color: #C8FF03;">return</span>(GenomicRanges::GRanges(seqnames = chrp,ranges=IRanges::IRanges(start = start,end = end)))
  }

  region_r <span style="color: #C04040;">&lt;-</span> ldetect_EUR[512]
  gr <span style="color: #C04040;">&lt;-</span> focus_gr(region_r)
  sn <span style="color: #C04040;">&lt;-</span> as.character(seqnames(gr))
  biomTrack <span style="color: #C04040;">&lt;-</span> BiomartGeneRegionTrack(genome=<span style="color: #FFABAB;">"hg19"</span>, chromosome=sn,start=starts(region_r),end=ends(region_r),geneSymbols=<span style="color: #99D6FF;">TRUE</span>,name=<span style="color: #FFABAB;">"ENSEMBL"</span>, filter=list(with_refseq_mrna=<span style="color: #99D6FF;">TRUE</span>),biomart=bm,stacking=<span style="color: #FFABAB;">"squish"</span>)

  top2 <span style="color: #C04040;">&lt;-</span> filter(pip_df, pip_model == max(pip_model))


  <span style="color: #FFE203;">igrf</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(tdf,ty){
    tyd <span style="color: #C04040;">&lt;-</span> ty$treatment
    inpl <span style="color: #C04040;">&lt;-</span> purrr::pmap(tdf, <span style="color: #C8FF03;">function</span>(file, name, sample, ...){
      rtracklayer::import(file, which = gr)
    }) <span style="color: #C04040;">%&gt;%</span> plyranges::bind_regions() <span style="color: #C04040;">%&gt;%</span> disjoin_regions(score=mean(score)) 
    inpl <span style="color: #C04040;">%&gt;%</span> tibble::as_tibble() <span style="color: #C04040;">%&gt;%</span>
      dplyr::rename({{tyd}} := score) <span style="color: #C04040;">%&gt;%</span> 
      plyranges::as_granges()
  }

  <span style="color: #FFE203;">ngrf</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(idf,y, ...){
    rrangel <span style="color: #C04040;">&lt;-</span> group_by(idf,treatment) <span style="color: #C04040;">%&gt;%</span>
      group_map(igrf)  <span style="color: #C04040;">%&gt;%</span>  purrr::reduce(join_overlap_inner)
    dtrack <span style="color: #C04040;">&lt;-</span> Gviz::DataTrack(rrangel,groups=c(<span style="color: #FFABAB;">"dec"</span>,<span style="color: #FFABAB;">"unt"</span>),name=glue::glue(<span style="color: #FFABAB;">"{y$mark}"</span>),type=<span style="color: #FFABAB;">"hist"</span>,window=-1,windowSize=1500)
  }

  idf <span style="color: #C04040;">&lt;-</span> dplyr::filter(input_df,mark==mark[1])
  tdf <span style="color: #C04040;">&lt;-</span> filter(idf,treatment==treatment[1])
  rangel <span style="color: #C04040;">&lt;-</span> group_by(input_df,mark) <span style="color: #C04040;">%&gt;%</span> group_map(ngrf)

  trackl <span style="color: #C04040;">&lt;-</span> c(biomTrack,rangel)
  strt <span style="color: #C04040;">&lt;-</span> positions(top2$snp_struct)
  grangel <span style="color: #C04040;">&lt;-</span> HighlightTrack(trackl,chromosome=sn,start=strt,width=10)
  png(file=<span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Hand2.png"</span>)
  plotTracks(c(grangel),chromosome=sn,from=starts(region_r),to=ends(region_r))
  dev.off()

  GeneRegionTrack(txdb)
  rangeld <span style="color: #C04040;">&lt;-</span> lapply(rangel,<span style="color: #C8FF03;">function</span>(df){
    mrk <span style="color: #C04040;">&lt;-</span> df$mark[1]
    df <span style="color: #C04040;">&lt;-</span> plyranges::select(df,-mark)

  })

    rangeldf <span style="color: #C04040;">&lt;-</span> bind_regions(rangel)


  plotTracks(rangeld,groups=c(<span style="color: #FFABAB;">"DSC1"</span>,<span style="color: #FFABAB;">"DSC2"</span>,<span style="color: #FFABAB;">"DSC3"</span>),type=c(<span style="color: #FFABAB;">"a"</span>,<span style="color: #FFABAB;">"p"</span>))






  <span style="color: #FFE203;">as_grange_df</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(df, ...) {
    rl <span style="color: #C04040;">&lt;-</span> rlang::list2(...)
    explode_ldmap_region(df) <span style="color: #C04040;">%&gt;%</span>
      dplyr::rename(seqnames = chrom) <span style="color: #C04040;">%&gt;%</span>
      mutate(seqnames = as.character(seqnames)) <span style="color: #C04040;">%&gt;%</span>
      mutate(!!!rl) <span style="color: #C04040;">%&gt;%</span>
      plyranges::as_granges()
  }

  <span style="color: #FFE203;">as_ldmr</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(df) {
    tibble::as_tibble(df) <span style="color: #C04040;">%&gt;%</span>
      dplyr::mutate(seqnames = as.integer(stringr::str_remove(seqnames,<span style="color: #FFABAB;">"chr"</span>))) <span style="color: #C04040;">%&gt;%</span> 
dplyr::select(-width) <span style="color: #C04040;">%&gt;%</span> 
      compact_ldmap_region(chrom = <span style="color: #FFABAB;">"seqnames"</span>)
  }


  read_df <span style="color: #C04040;">&lt;-</span> as_ldmr(ranged) <span style="color: #C04040;">%&gt;%</span> dplyr::select(-strand)
  pread_df <span style="color: #C04040;">&lt;-</span> tidyr::pivot_wider(read_df,names_from=c(<span style="color: #FFABAB;">"mark"</span>,<span style="color: #FFABAB;">"sample"</span>,<span style="color: #FFABAB;">"treatment"</span>),values_from=c(<span style="color: #FFABAB;">"score"</span>))
  ldmdf <span style="color: #C04040;">&lt;-</span> as_ldmr(out.gr)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-shell">
rsync -av rcc2:/project2/xinhe/software/ldsc/workflow/results ../workflow/results
</pre>
</div>
</div>
</div>
