org/pipeline.org
*** eQTL mapping

#+BEGIN_SRC snakemake :mkdirp :tangle ../workflow/eqtl_snakefile

  rule gwas_h52torus:
      input:
          inputf=config_d['GENO']
          snplist = expand(config_d['1KG'] +"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim",chrom=range(1,23))
      output:
          outputf=config_d['GWAS'] +"{gwas}_torus.txt.gz"
      conda:
          config_e['r']
      script:
          "../scripts/gen_torus_sumstats.R"


#+END_SRC



#+BEGIN_SRC R :session 
  snplistf <- glue::glue("/run/media/nwknoblauch/Data/1kg/1000G_EUR_Phase3_plink/1000G.EUR.QC.{1:22}.bim")
      bc <- bim_cols(chrom = col_chromosome(prefix_chr=FALSE))
  kgsnp_df <- purrr::map_df(snplistf,
                            ~dplyr::select(read_plink_bim(.x,cols = bc),snp_struct))
#+END_SRC

#+BEGIN_SRC R :session 

kgsnp_df <- arrange(kgsnp_df,snp_struct) %>% mutate(region_id= snp_in_region(snp_struct,ldetect_EUR),ldmr=ldetect_EUR[region_id])
#+END_SRC

#+BEGIN_SRC R :session :colnames yes

rename(sig_snp_fdr,locus=ldmr) %>% group_by(locus) %>% filter(pval==min(pval)) %>% slice(1) %>% ungroup()
#+END_SRC

#+RESULTS:
|  rej | region_id |         fdr | decision | locus                    |      pval | snp_struct          |
|------+-----------+-------------+----------+--------------------------+-----------+---------------------|
|    3 |        15 | 3.38354e-06 |        1 | chr1:21736588_23086883   | 6.414e-13 | chr1:22468215_T_C   |
|    4 |       353 |  0.00101615 |        1 | chr3:121974097_123517768 |  8.56e-10 | chr3:123085359_T_C  |
|    2 |       356 | 9.27161e-07 |        1 | chr3:126214943_128194861 | 3.991e-13 | chr3:127869598_C_A  |
|   10 |       363 |     0.18815 |        0 | chr3:139954597_141339097 | 4.885e-09 | chr3:141112860_NA_S |
|    5 |       373 |  0.00128931 |        1 | chr3:154714218_156008700 | 3.827e-10 | chr3:155855501_NA_S |
|    1 |       614 | 3.79167e-19 |        1 | chr5:156628700_158825698 | 1.637e-26 | chr5:157888115_T_C  |
| 1509 |      1455 |    0.968653 |        0 | chr16:46399473_49007926  | 3.391e-09 | chr16:47665580_T_C  |


#+BEGIN_SRC R :session :colnames yes


  snp_df <- mutate(snp_df,region_id= snp_in_region(snp_struct,ldetect_EUR),ldmr=ldetect_EUR[region_id])
  sig_regions <- distinct(sig_snp_df,region_id)
  tkg_df <- semi_join(kgsnp_df,sig_regions) %>% explode_snp_struct(remove=FALSE) 
  tsnp_df <- semi_join(snp_df,sig_regions) %>% explode_snp_struct(remove=FALSE) %>%semi_join(tkg_df,by=c("chrom","pos"))
  
  inner_join(tsnp_df,torus_null_fdr) %>%
    rename(locus=ldmr) %>%
    group_by(locus) %>%
    filter(pval==min(pval)) %>%
    slice(1) %>%
    ungroup()
#+END_SRC

#+RESULTS:
| rej | region_id |         fdr | decision | locus                    |      pval | chrom |       pos | ref | alt |
|-----+-----------+-------------+----------+--------------------------+-----------+-------+-----------+-----+-----|
|   3 |        15 | 3.38354e-06 |        1 | chr1:21736588_23086883   | 6.414e-13 |     1 |  22468215 | T   | C   |
|   4 |       353 |  0.00101615 |        1 | chr3:121974097_123517768 |  8.56e-10 |     3 | 123085359 | T   | C   |
|   2 |       356 | 9.27161e-07 |        1 | chr3:126214943_128194861 | 3.991e-13 |     3 | 127869598 | C   | A   |
|   5 |       373 |  0.00128931 |        1 | chr3:154714218_156008700 | 2.056e-09 |     3 | 155855597 | G   | A   |
|   1 |       614 | 3.79167e-19 |        1 | chr5:156628700_158825698 | 1.637e-26 |     5 | 157888115 | T   | C   |


** motifbreakR

#+BEGIN_SRC R 



#+END_SRC
