docs/pipeline.html



<div id="outline-container-org9873146" class="outline-4">
<h4 id="org9873146">eQTL mapping</h4>
<div class="outline-text-4" id="text-org9873146">
<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gwas_h52torus</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">inputf</span>=config_d[<span style="color: #FFABAB;">'GENO'</span>]
        <span style="color: #FF9326;">snplist</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'1KG'</span>] +<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23))
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">outputf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"{gwas}_torus.txt.gz"</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'r'</span>]
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/gen_torus_sumstats.R"</span>


</pre>
</div>



<div class="org-src-container">
<pre class="src src-R">snplistf <span style="color: #C04040;">&lt;-</span> glue::glue(<span style="color: #FFABAB;">"/run/media/nwknoblauch/Data/1kg/1000G_EUR_Phase3_plink/1000G.EUR.QC.{1:22}.bim"</span>)
    bc <span style="color: #C04040;">&lt;-</span> bim_cols(chrom = col_chromosome(prefix_chr=<span style="color: #99D6FF;">FALSE</span>))
kgsnp_df <span style="color: #C04040;">&lt;-</span> purrr::map_df(snplistf,
                          ~dplyr::select(read_plink_bim(.x,cols = bc),snp_struct))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
kgsnp_df <span style="color: #C04040;">&lt;-</span> arrange(kgsnp_df,snp_struct) <span style="color: #C04040;">%&gt;%</span> mutate(region_id= snp_in_region(snp_struct,ldetect_EUR),ldmr=ldetect_EUR[region_id])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
rename(sig_snp_fdr,locus=ldmr) <span style="color: #C04040;">%&gt;%</span> group_by(locus) <span style="color: #C04040;">%&gt;%</span> filter(pval==min(pval)) <span style="color: #C04040;">%&gt;%</span> slice(1) <span style="color: #C04040;">%&gt;%</span> ungroup()
</pre>
</div>


<div class="org-src-container">
<pre class="src src-R">

snp_df <span style="color: #C04040;">&lt;-</span> mutate(snp_df,region_id= snp_in_region(snp_struct,ldetect_EUR),ldmr=ldetect_EUR[region_id])
sig_regions <span style="color: #C04040;">&lt;-</span> distinct(sig_snp_df,region_id)
tkg_df <span style="color: #C04040;">&lt;-</span> semi_join(kgsnp_df,sig_regions) <span style="color: #C04040;">%&gt;%</span> explode_snp_struct(remove=<span style="color: #99D6FF;">FALSE</span>) 
tsnp_df <span style="color: #C04040;">&lt;-</span> semi_join(snp_df,sig_regions) <span style="color: #C04040;">%&gt;%</span> explode_snp_struct(remove=<span style="color: #99D6FF;">FALSE</span>) <span style="color: #C04040;">%&gt;%</span>semi_join(tkg_df,by=c(<span style="color: #FFABAB;">"chrom"</span>,<span style="color: #FFABAB;">"pos"</span>))

inner_join(tsnp_df,torus_null_fdr) <span style="color: #C04040;">%&gt;%</span>
  rename(locus=ldmr) <span style="color: #C04040;">%&gt;%</span>
  group_by(locus) <span style="color: #C04040;">%&gt;%</span>
  filter(pval==min(pval)) <span style="color: #C04040;">%&gt;%</span>
  slice(1) <span style="color: #C04040;">%&gt;%</span>
  ungroup()
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org32f6151" class="outline-3">
<h3 id="org32f6151">motifbreakR</h3>
<div class="outline-text-3" id="text-org32f6151">
<div class="org-src-container">
<pre class="src src-R">


</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nicholas Knoblauch</p>
<p class="date">Created: 2020-05-08 Fri 10:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
